[
  {
    "title": "Get Your Latest NBA News From RealGM's Basketball Wiretap",
    "summary": "Get all the latest news and happenings from around the NBA with RealGM's Basketball Wiretap.",
    "link": "https://basketball.realgm.com/news",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-12-01T22:17:01",
    "image": null,
    "tags": [],
    "id": "https://basketball.realgm.com/news"
  },
  {
    "title": "Warriors Sign LJ Cryer To Two-Way Deal, Waive Jackson Rowe",
    "summary": "<p>The Golden State Warriors have agreed to sign LJ Cryer to a Two-Way deal. In a related move, the Warriors have waived Jackson Rowe.</p>\n<p>Rowe hadn't appeared in any games this season with the Warriors after playing in six last season.</p>\n<p>Cryer was with the Warriors in training camp and appeared in five preseason games.</p>",
    "link": "https://basketball.realgm.com/wiretap/282959/Warriors-Sign-LJ-Cryer-To-Two-Way-Deal-Waive-Jackson-Rowe",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-12-01T22:08:00",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_goldenstatewarriors.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282959/Warriors-Sign-LJ-Cryer-To-Two-Way-Deal-Waive-Jackson-Rowe"
  },
  {
    "title": "Terry Rozier's $8.2M IRS Tax Lien Released After Payment",
    "summary": "<p>The Internal Revenue Service released an $8.2 million tax lien filed against NBA guard Terry Rozier, according to Broward County courthouse records obtained by ESPN. The release was filed October 29, one day after ESPN reported on the lien and less than a week after Rozier's arrest on federal gambling charges.</p>\n<p>The lien release lists $8,218,211 under \"unpaid balance of assessment.\" It was recorded with the Broward County Courthouse in Florida on November 20.</p>\n<p>Rozier's attorney, Jim Trusty, initially told ESPN in October that Rozier owed only $9,000 in unpaid taxes. He later revised that amount to $3,000, attributing the lien to an e-filing error.</p>\n<p>\"Once the accountant clarified the situation with the IRS, Terry was found to owe only $3,000 in unpaid taxes for 2021,\" Trusty told ESPN in October. \"That amount has been taken care of and we fully expect the defunct lien to be withdrawn in the near future.\"</p>\n<p>Trusty did not provide documentation of the amount owed or when it was paid. He did not immediately respond to a request for comment Monday.</p>\n<p>An IRS spokesperson said the agency cannot disclose information about individual taxpayers and declined further comment. The IRS has 30 days to file a lien release after a debt has been paid.</p>\n<p>The original lien was issued in November 2023 in Broward County, where Rozier purchased property in June 2021. Tom O'Saben, director of tax content and government relations for the National Association of Tax Professionals, said taxpayers are generally notified within hours if an e-file has been accepted.</p>\n<p>A failed e-filing attempt and unpaid tax bill would have generated multiple notifications to Rozier or his tax representatives, O'Saben noted.</p>\n<p>Rozier faces separate federal charges of conspiracy to commit wire fraud and money laundering related to an alleged gambling scandal. He is accused of providing nonpublic information about his plans to leave a game in March 2023 to a friend who allegedly sold it to bettors.</p>\n<p>Rozier is scheduled for arraignment in federal court December 8 in Brooklyn. Trusty has said his client is not guilty.</p>",
    "link": "https://basketball.realgm.com/wiretap/282958/Terry-Roziers-$82M-IRS-Tax-Lien-Released-After-Payment",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-12-01T21:15:18",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Rozier_Terry_mia_240226.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282958/Terry-Roziers-$82M-IRS-Tax-Lien-Released-After-Payment"
  },
  {
    "title": "Garrison Mathews, Pacers Sign 2nd 10-Day Hardship Contract",
    "summary": "<p>Garrison Mathews and the Indiana Pacers have agreed to a second 10-day hardship contract. </p>\n<p>Mathews has appeared in five games this season with the Pacers, averaging 1.8 points in 9.2 minutes. Matthews spent the past two seasons with the Atlanta Hawks.</p>\n<p>Matthews was with the New York Knicks for training camp.</p>",
    "link": "https://basketball.realgm.com/wiretap/282957/Garrison-Mathews-Pacers-Sign-2nd-10-Day-Hardship-Contract",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-12-01T16:28:32",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_indianapacers.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282957/Garrison-Mathews-Pacers-Sign-2nd-10-Day-Hardship-Contract"
  },
  {
    "title": "Jalen Brunson, Luka Doncic Named NBA's Players Of Week 6",
    "summary": "<p>Jalen Brunson and Luka Doncic have been named the <a href=\"https://basketball.realgm.com/nba/awards/by-type/player-of-the-week/30\">NBA's Players of the Week</a> for Week 6.</p>\n<p>Brunson averaged 28.8 points and 4.5 assists as the New York Knicks went 4-0.</p>\n<p>Doncic averaged 37.3 points, 8.7 rebounds and 10.3 assists as the Los Angeles Lakers went 3-0.</p>",
    "link": "https://basketball.realgm.com/wiretap/282956/Jalen-Brunson-Luka-Doncic-Named-NBAs-Players-Of-Week-6",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-12-01T15:45:06",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Brunson_Jalen_nyk_250421.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282956/Jalen-Brunson-Luka-Doncic-Named-NBAs-Players-Of-Week-6"
  },
  {
    "title": "Bulls Model Offense After Pacers' Fast-Paced System",
    "summary": "<p>The Chicago Bulls transformed their offensive system after studying the Indiana Pacers' run to the NBA Finals last season. Billy Donovan implemented a 14-second shot clock during player-driven workouts in Miami before training camp to accelerate the team's pace. The Bulls jumped from 28th in the NBA in pace in 2023-24 to second in 2024-25.</p>\n<p>\"They stole our mojo,\" a Pacers team source told ESPN. \"They said before the season they were going to emulate our play style. Giddey playing the role as Tyrese. The fast pace, the late-game comebacks, wearing teams down.\"</p>\n<p>The Bulls looked at their final 20 games of last season when they went 14-6. They then studied the Pacers' roster construction and playing style built around multiple ball handlers and ball movement. Chicago saw a blueprint for what they could become if they followed the same course.</p>\n<p>\"That's who we have to be,\" Donovan said. \"We have to be better than the sum of our parts.\"</p>\n<p>Chicago acquired Josh Giddey from Oklahoma City in June 2024 to serve as the engine of their new system. The Bulls envisioned Giddey playing a similar role to Pacers All-Star Tyrese Haliburton as a pass-first playmaker. Multiple Bulls team sources acknowledged the similarities between what they are building and Indiana's construction.</p>\n<p>However, sources cited two key differences between the franchises. The Pacers played stingier defense, ranking 13th in defensive efficiency last season. Indiana also paired a second star, Pascal Siakam, alongside Haliburton to reach the Finals.</p>\n<p>\"They have Haliburton, who is an All-Star, and they have Siakam,\" one Bulls source told ESPN. \"If Giddey can develop into an All-Star and be what Hali was, when do we pull the trigger to get our Siakam?\"</p>\n<p>Giddey is nearly averaging a triple-double this season with 20.5 points, 10.0 rebounds and 9.3 assists. He is shooting a career-best 39.2 percent from three-point range. Chicago has eight players averaging double figures and ranks second in bench scoring.</p>\n<p>The Bulls started 6-1 this season with a top-10 pace and ranked seventh in offense and 10th in defense. Since then they have fallen to 9-10 and rank 23rd in both offense and defense. Chicago is giving up an average of 56.5 points in the paint during that stretch, third-most in the NBA.</p>\n<p>\"If you look at the teams, it's similar personnel,\" Giddey told ESPN. \"Tyrese obviously is an unbelievable player, but they don't have that one superstar. They've got a lot of really, really solid, good players. They defend collectively, and that's an area we need to get better at.\"</p>\n<p>Donovan emphasized that Indiana's physicality on defense often gets overlooked in discussions about their pace. The Bulls coach said Chicago's defensive evolution must continue to match what the Pacers accomplished. The team finished with an identical 39-43 record last season despite the pace transformation.</p>",
    "link": "https://basketball.realgm.com/wiretap/282955/Bulls-Model-Offense-After-Pacers-Fast-Paced-System",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-12-01T12:13:25",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Giddey_Josh_chi_241010.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282955/Bulls-Model-Offense-After-Pacers-Fast-Paced-System"
  },
  {
    "title": "Bulls Have Had Internal Discussions About Trading For Anthony Davis",
    "summary": "<p>The Chicago Bulls have held internal discussions about acquiring Dallas Mavericks star Anthony Davis, sources told ESPN. However, team sources said the Bulls will not sacrifice any of their young core to execute such a deal until the team is closer to contention. The Bulls believe Davis could help their rim protection and defensive interior issues.</p>\n<p>Davis is from Chicago and the Bulls have three players on the roster who grew up in the area. Ayo Dosunmu, Jevon Carter and Matas Buzelis are all from the Chicago region, which sources indicated is not a coincidence. The Bulls view their local connections as valuable assets in building the franchise.</p>\n<p>\"I don't think going out and chasing X megastar is the way to proceed -- at least today,\" one source told ESPN.</p>\n<p><a href=\"https://basketball.realgm.com/nba/teams/Chicago-Bulls/4/draft-picks\">Chicago owns its first-round draft picks for the next seven years plus an additional 2026 top-14-protected first from Portland</a>. <a href=\"https://basketball.realgm.com/nba/draft/future_drafts/tradeable\">The Bulls can trade up to five first-round picks and five second-round picks</a>. The team could have close to $70 million in cap room next offseason, according to ESPN's Bobby Marks.</p>\n<p>Chicago still sees Josh Giddey, Coby White and Matas Buzelis as its future core, team sources said. Rookie Noa Essengue, the No. 12 pick in the 2025 draft who does not turn 19 until later this month, is also viewed as part of that foundation. The Bulls know they need to continue adding to that core and are prepared to do so.</p>",
    "link": "https://basketball.realgm.com/wiretap/282953/Bulls-Have-Had-Internal-Discussions-About-Trading-For-Anthony-Davis",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-12-01T11:28:27",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Davis_Anthony_dal_250208.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282953/Bulls-Have-Had-Internal-Discussions-About-Trading-For-Anthony-Davis"
  },
  {
    "title": "NBA PER (Week 6): Kawhi Leonard Rises To No. 7",
    "summary": "<p>Kawhi Leonard is averaging more points (25.4) in any season since his first with the Los Angeles Clippers in 2019-20 while also playing in his fewest minutes at 31.3 as he's posting a .640 True Shooting Percentage and has a PER of 25.0, which ranks seventh in the NBA.</p>\n<p>The anticipated top-4 of Nikola Jokic, Giannis Antetokounmpo, Shai Gilgeous-Alexander and Luka Doncic continue to lead the NBA in the category. </p>\n<p><span style=\"text-decoration: underline;\"><strong>NBA PER (Week 6):</strong></span><br />1. Nikola Jokic: 35.6<br />2. Giannis Antetokounmpo: 35.4<br />3. Shai Gilgeous-Alexander: 32.6<br />4. Luka Doncic: 29.4<br />5. Jalen Duren: 25.4<br />6. Victor Wembanyama: 25.3<br />7. Kawhi Leonard: 25.0<br />8. Austin Reaves: 24.7<br />9. Jimmy Butler: 24.5<br />10. Zach Edey: 23.9<br />11. James Harden: 23.7<br />12. Donovan Mitchell: 23.7<br />13. Anthony EdwardS: 23.6<br />14. Tyrese Maxey: 23.1<br />15. Stephen Curry: 22.5<br />16. Anthony Davis: 22.4<br />17. Kristaps Porzingis: 22.4<br />18. Jalen Johnson: 22.3<br />19. Jaylen Brown: 22.1<br />20. Mark Williams: 21.9</p>",
    "link": "https://basketball.realgm.com/wiretap/282952/NBA-PER-Week-6-Kawhi-Leonard-Rises-To-No-7",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-12-01T09:50:00",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Leonard_Kawhi_lac_250423.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282952/NBA-PER-Week-6-Kawhi-Leonard-Rises-To-No-7"
  },
  {
    "title": "Comsport Agency Credited With Fueling French Basketball Influx Into NBA",
    "summary": "<p>Bouna Ndiaye and Jeremy Medjana built Comsport into the premier agency for French basketball players and are credited with helping fuel the modern influx of French talent into the NBA. Spurs chief executive R.C. Buford said Ndiaye's work with Nicolas Batum, Rudy Gobert and others helped create the pipeline. The duo now represents Victor Wembanyama, whose story in a movie called \"The American Dream\" will be released in February.</p>\n<p>\"That has to be some reflection of the work that he has done with Batum and Rudy and the other people that he has represented and helped grow,\" Buford said.</p>\n<p>France won the silver medal at the last Olympics and two of the last three top NBA draft picks were French. Comsport has guided clients through deals worth hundreds of millions of dollars with Ndiaye based in Dallas and Medjana in Paris. The agency pitched Wembanyama when he was 15 after tracking him for five years.</p>\n<p>Ndiaye, 59, and Medjana, 53, founded the agency nearly 30 years ago but struggled financially for a decade. Ndiaye worked construction jobs and cleaned airplanes while Medjana taught elementary school and sold knockoff designer clothes. The agency went bankrupt after client Ronny Turiaf left before his first major NBA payday.</p>\n<p>\"You forget the struggle,\" Ndiaye said. \"Ten years, you're not making any money. You keep believing that you're going to make it.\"</p>\n<p>Their breakthrough came in 2005 when Ian Mahinmi became their first NBA first-round draft pick. Ndiaye bonded with Mahinmi's family over their shared African roots during the pitch meeting. The agency later signed Batum, Fournier and Gobert as they entered the NBA.</p>\n<p>In 2016, four Comsport clients signed contracts worth a combined $371 million. The previous year those players presented Ndiaye with a Rolex watch at his surprise 50th birthday party. The French government administered a seven-year recovery plan for the agency's finances before the turnaround.</p>\n<p>The agency still scouts talent at youth tournaments worldwide despite their success. Ndiaye recently arranged for Wembanyama to spend 11 days training in kung fu at a 1,500-year-old Buddhist temple in China. The unconventional offseason program reflected their hands-on approach to player development.</p>",
    "link": "https://basketball.realgm.com/wiretap/282951/Comsport-Agency-Credited-With-Fueling-French-Basketball-Influx-Into-NBA",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-12-01T09:39:43",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Wembanyama_Victor_sas_241010.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282951/Comsport-Agency-Credited-With-Fueling-French-Basketball-Influx-Into-NBA"
  },
  {
    "title": "WNBA, Players Extend CBA Deadline To January 9 Amid Ongoing Negotiations",
    "summary": "<p>The WNBA and WNBA Players Association agreed to extend the current collective bargaining agreement through January 9 as negotiations continue toward a new deal. The league announced the extension Sunday night shortly before the 11:59 p.m. ET deadline. The agreement includes an option for either party to terminate the extension with 48 hours' notice.</p>\n<p>The union proposed a six-week extension after initially discussing a 24-hour extension, according to sources. The league pushed for an extension of 21 days before both sides reached the compromise. This marks the second extension after the initial October 31 deadline was extended by 30 days last month.</p>\n<p>\"We expect substantive movement from the league within this window,\" the union said in a statement.</p>\n<p>The two sides have remained far apart on determining salary structure and revenue sharing systems. The WNBA proposed a deal in November featuring significant increases with maximum salaries exceeding $1.1 million and minimum salaries above $220,000. The league's minimum salary was $66,079 in 2025 while the supermax was $249,244.</p>\n<p>The WNBPA rejected the proposal as sources told ESPN players felt it lacked a system where the salary cap would grow sufficiently with the business. Players want a salary cap directly determined by basketball-related income similar to the NBA model. The current cap of $1,507,100 grows at a fixed rate of 3 percent annually under the existing CBA.</p>\n<p>The current agreement includes a separate revenue sharing provision granting direct payments if certain targets are met. This provision has not been triggered largely due to the COVID-19 pandemic's impact. Players are also pushing for minimum professional standards in facilities, codification of charter travel and expanded retirement and family planning benefits.</p>\n<p>The league stated it wants to substantially increase player salaries and cost commitments while incentivizing owners to continue investing. The WNBA's recent growth provides opportunity to shift from operating at losses to building sustained profitability. Both sides met frequently including Sunday as they exchanged updated proposals.</p>",
    "link": "https://basketball.realgm.com/wiretap/282950/WNBA-Players-Extend-CBA-Deadline-To-January-9-Amid-Ongoing-Negotiations",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-12-01T09:33:06",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_wnba.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282950/WNBA-Players-Extend-CBA-Deadline-To-January-9-Amid-Ongoing-Negotiations"
  },
  {
    "title": "Keon Johnson Claimed By Maine Celtics",
    "summary": "<p>Keon Johnson has been claimed by the G League's Maine Celtics, sources told Michael Scotto of HoopsHype.</p>\n<p>Johnson started 56 games for the Nets last season, averaging 10.6 points and 3.8 rebounds. </p>",
    "link": "https://basketball.realgm.com/wiretap/282949/Keon-Johnson-Claimed-By-Maine-Celtics",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-12-01T00:41:37",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Johnson_Keon_por_230109.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282949/Keon-Johnson-Claimed-By-Maine-Celtics"
  },
  {
    "title": "Trae Young Progressing From Sprained MCL, Will Be Re-Evaluated In 2 Weeks",
    "summary": "<p>Trae Young is progressing from his sprained MCL and will be re-evaluated in two weeks, the Atlanta Hawks announced over the weekend. </p>\n<p>Young, who was injured on October 29, has missed 15 games.</p>\n<p>The Hawks are 10-5 since the knee injury.</p>\n<p>Young is averaging 17.8 points and 7.8 assists per game on the season.</p>",
    "link": "https://basketball.realgm.com/wiretap/282948/Trae-Young-Progressing-From-Sprained-MCL-Will-Be-Re-Evaluated-In-2-Weeks",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-12-01T00:39:12",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Young_Trae_atl_240513.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282948/Trae-Young-Progressing-From-Sprained-MCL-Will-Be-Re-Evaluated-In-2-Weeks"
  },
  {
    "title": "Giannis Antetokounmpo Sets Ambitious Timeline To Join NBA's All-Time Scoring Elite",
    "summary": "<p>Giannis Antetokounmpo announced ambitious plans to reach the top of the NBA's all-time scoring list within four to five years. The Milwaukee Bucks star made the declaration after reaching 21,000 career points in Saturday's victory over Brooklyn. Antetokounmpo believes he can join basketball's greatest scorers by age 35, challenging projections that the feat would take longer.</p>\n<p>\"I think to get to the top of the scoring list, it's not six, seven, eight years away,\" Antetokounmpo said. \"I think, in my opinion, it's four years away. Four, five years away, 4 1/2 years away.\"</p>\n<p>The two-time MVP outlined a specific vision for his remaining career. He stated that by age 35, he expects to have established himself among the all-time scoring leaders. Antetokounmpo emphasized this is not merely hopeful thinking but a concrete goal he intends to achieve.</p>\n<p>\"I think when I am going to be 35 years old and sitting in this chair, and we want to have a discussion of I am in the top list of all time in scoring, I would have talked that into existence,\" Antetokounmpo said. \"And not just talking it into existence because I believe that I'm going to do it. It's something that I want to do.\"</p>\n<p>Antetokounmpo has averaged 2,055 points over his last four seasons. If he maintains an average of 2,000 points annually through the 2029-30 season, he would eclipse 30,000 career points. That total would place him among the top 10 scorers in NBA history.</p>\n<p>The timeline requires sustained health and elite production through his mid-thirties. Antetokounmpo has scored 464 points through 15 games this season. The Bucks forward became the sixth-youngest player to reach 21,000 points, joining Michael Jordan, Kobe Bryant, LeBron James, Wilt Chamberlain and Kevin Durant.</p>\n<p>\"Just to be on that list with them is incredible,\" Antetokounmpo said. \"Have I accomplished as much as them? I don't think so. Do I have a lot of room to improve and room to grow and years to keep on writing my own legacy? Yes.\"</p>",
    "link": "https://basketball.realgm.com/wiretap/282947/Giannis-Antetokounmpo-Sets-Ambitious-Timeline-To-Join-NBAs-All-Time-Scoring-Elite",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-30T21:58:47",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/AntetokounmpoLeBron2020.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282947/Giannis-Antetokounmpo-Sets-Ambitious-Timeline-To-Join-NBAs-All-Time-Scoring-Elite"
  },
  {
    "title": "Jazz Signal Intent To Build Around Lauri Markkanen Rather Than Explore Trade",
    "summary": "<p>The Utah Jazz are signaling a shift away from rebuilding mode. League sources increasingly believe the team will add talent around Lauri Markkanen this trade season rather than trade their star forward. The move would mark Utah's attempt to return to playoff contention after three seasons outside the postseason.</p>\n<p>Markkanen is averaging a career-high 28.5 points per game in his ninth NBA season. The 7-foot forward has emerged as a franchise cornerstone following strong performances with Finland's national team this summer. He signed a four-year, $220 million extension with Utah in August 2024.</p>\n<p>The extension included a trade restriction that expired at the end of the 2024-25 season. Markkanen can now be traded, but the Jazz appear committed to keeping him. Multiple front offices around the league report similar intel about Utah's intentions.</p>\n<p>Utah has not reached the playoffs since the 2021-22 season. The franchise traded Rudy Gobert and Donovan Mitchell that offseason, beginning a roster overhaul. </p>\n<p>When Markkanen signed his extension, there was reportedly an understanding that Utah would make \"<a href=\"https://basketball.realgm.com/wiretap/279648/Jazz-Promised-Lauri-Markkanen-Timely-Turn-Toward-Competing-When-Signing-Extension\">a timely turn toward competing</a>.\" The 28-year-old forward has publicly expressed his affection for Salt Lake City. </p>\n<p>The Jazz front office, led by Danny Ainge and Austin Ainge, has been difficult for rival teams to read. However, league-wide sentiment now suggests Utah is ready to accelerate its timeline. The team appears poised to become buyers rather than sellers as the trade deadline approaches.</p>\n<p><a href=\"https://basketball.realgm.com/nba/teams/Utah-Jazz/29/draft-picks\">Utah's first round pick this season is only protected if it lands in the top-8 as it will otherwise be sent to the Oklahoma City Thunder</a>. </p>",
    "link": "https://basketball.realgm.com/wiretap/282946/Jazz-Signal-Intent-To-Build-Around-Lauri-Markkanen-Rather-Than-Explore-Trade",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-30T21:44:03",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Markkanen_Lauri_uta_231220.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282946/Jazz-Signal-Intent-To-Build-Around-Lauri-Markkanen-Rather-Than-Explore-Trade"
  },
  {
    "title": "Jarrett Allen, Sam Merrill, Larry Nance To Miss Time For Cavs",
    "summary": "<p>The Cleveland Cavaliers shared injury updates for Jarrett Allen, Sam Merrill and Larry Nance Jr. All three players are going to miss time for the Cavs.</p>\n<p>Allen will be out for at least one week due to a right finger sprain. The veteran center has been playing through a fracture in his left ring finger, before missing three games due to the right finger sprain. Allen attempted to play Friday, but will now be out for at least one more week.</p>\n<p>Merrill remains day-to-day with a right hand sprain. The Cavs shooting specialist has missed the last five games due to the injury.</p>\n<p>Nance will miss three-to-four weeks due to a right calf strain. Nance was injured in Friday's game against the Hawks.</p>\n<p> </p>",
    "link": "https://basketball.realgm.com/wiretap/282945/Jarrett-Allen-Sam-Merrill-Larry-Nance-To-Miss-Time-For-Cavs",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-30T18:11:21",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Allen_Jarrett_cle_221115.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282945/Jarrett-Allen-Sam-Merrill-Larry-Nance-To-Miss-Time-For-Cavs"
  },
  {
    "title": "Joel Embiid, VJ Edgecombe Return To Play Sunday",
    "summary": "<p>The Philadelphia 76ers are getting two members of their starting lineup back on Sunday. Center Joel Embiid and guard VJ Edgecombe will both play vs the Atlanta Hawks.</p>\n<p>Embiid has been out for the last three weeks due to knee soreness. Overall, the veteran center has played in just six of the Sixers first 18 games this season.</p>\n<p>Edgecombe has missed Philadelphia's last three games. The rookie guard has been out with a strained calf. Edgecombe has averaged 15.6 points, 6.0 rebounds, 4.2 assists and 1.3 steals through 15 games this season.</p>",
    "link": "https://basketball.realgm.com/wiretap/282944/Joel-Embiid-VJ-Edgecombe-Return-To-Play-Sunday",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-30T17:57:18",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Embiid_Joel_phi_231130.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282944/Joel-Embiid-VJ-Edgecombe-Return-To-Play-Sunday"
  },
  {
    "title": "Pacers Signing Ethan Thompson; Waiving RayJ Dennis",
    "summary": "<p>The Indiana Pacers are making a change within their two-way ranks. Indiana will sign shooting guard Ethan Thompson. To make room for Thompson, the Pacers are waiving guard RayJ Dennis.</p>\n<p>Thompson will be eligible to be active for up to 38 NBA games on his prorated two-way deal. The 6-foot-4 guard has averaged 26.9 points, 5.8 rebounds and 6.5 assists in eight G League games for the Sioux Falls Skyforce this season.</p>\n<p>Dennis has been active for 20 NBA games this season for the Pacers. The 6-foot-1 point has averaged 4.9 points in 12.9 minutes over 13 NBA games.</p>",
    "link": "https://basketball.realgm.com/wiretap/282943/Pacers-Signing-Ethan-Thompson;-Waiving-RayJ-Dennis",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-30T12:47:04",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_indianapacers.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282943/Pacers-Signing-Ethan-Thompson;-Waiving-RayJ-Dennis"
  },
  {
    "title": "Seth Curry To Re-Sign With Warriors On Monday",
    "summary": "<p>Seth Curry will re-sign with the Golden State Warriors on Monday. Curry was waived at the end of the preseason, because the Warriors were unable to keep him and stay below their second-apron hard cap.</p>\n<p>Curry will sign a veteran minimum deal now that contracts have prorated enough for Golden State to fit the deal under their hard cap. The Warriors were expected to add Curry earlier this month, but have held off to create extra space under the second apron.</p>\n<p>Golden State will be the tenth different team Curry has played for. The veteran guard has also suited up for the Memphis Grizzlies, Cleveland Cavaliers, Phoenix Suns, Sacramento Kings, Dallas Mavericks, Portland Trail Blazers, Philadelphia 76ers, Brooklyn Nets and Charlotte Hornets.</p>",
    "link": "https://basketball.realgm.com/wiretap/282942/Seth-Curry-To-Re-Sign-With-Warriors-On-Monday",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-30T10:07:42",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Curry_Seth_cha_240314.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282942/Seth-Curry-To-Re-Sign-With-Warriors-On-Monday"
  },
  {
    "title": "Cooper Flagg Becomes Second 18-Year-Old To Score 30 Points In A Game",
    "summary": "<p>In the Dallas Mavericks victory at the LA Clippers, rookie forward Cooper Flagg scored 35 points. By doing so, Flagg joined LeBron James as the only players in NBA history to score 30 or more points before turning 19 years old.</p>\n<p>In addition, Flagg is the youngest player ever to score 35 points in a game. This on top of becoming the first 18-year-old to tally as many as 11 assists in a game, which the Mavs rookie achieved on Friday.</p>\n<p>For the season, Flagg is averaging 16.7 points, 6.6 rebounds, 3.5 assists and 1.4 steals per game. Flagg has played in 20 of the Mavericks 21 games.</p>",
    "link": "https://basketball.realgm.com/wiretap/282941/Cooper-Flagg-Becomes-Second-18-Year-Old-To-Score-30-Points-In-A-Game",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-30T09:31:29",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Flagg_Cooper_dal_251010.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282941/Cooper-Flagg-Becomes-Second-18-Year-Old-To-Score-30-Points-In-A-Game"
  },
  {
    "title": "Isaiah Hartenstein Out 10-14 Days Due To Soleus Strain",
    "summary": "<p>The Oklahoma City Thunder are an NBA-best 19-1 this season. The scary part for the rest of the NBA? The Thunder haven't had their whole roster available for a single game this season. Jalen Williams returned to the lineup this week, but now Oklahoma City will be without center Isaiah Hartenstein for a while.</p>\n<p>Hartenstein is set to miss at least 10-14 days due to a right soleus strain. That means the Thunder will go longer without a full complement of players available to them.</p>\n<p>With Hartenstein out of the lineup, Oklahoma City will play Chet Holmgren at center. They'll lean on Jaylin Williams, Kenrich Williams and two-way player Branden Carlson for frontcourt depth.</p>",
    "link": "https://basketball.realgm.com/wiretap/282940/Isaiah-Hartenstein-Out-10-14-Days-Due-To-Soleus-Strain",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-29T22:07:20",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Hartenstein_Isaiah_okc_241018.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282940/Isaiah-Hartenstein-Out-10-14-Days-Due-To-Soleus-Strain"
  },
  {
    "title": "Andre Drummond Suffered No Structural Damage In Right Knee",
    "summary": "<p>The Philadelphia 76ers got some good news on the injury front on Saturday morning. Center Andre Drummond suffered no structural damage in his right knee. There is hope Drummond will return from the injury fairly quickly.</p>\n<p>The Sixers backup center was forced to leave Friday's victory over the Brooklyn early. There was fear that Drummond may have suffered a more serious injury than imaging showed.</p>\n<p>The veteran center has started in nine of the 17 games he's played for Philadelphia this year. Drummond is regularly called upon to started when Joel Embiid is out of the lineup. Drummond is averaging 8.2 points, 10.3 rebounds and a block per game this season.</p>",
    "link": "https://basketball.realgm.com/wiretap/282939/Andre-Drummond-Suffered-No-Structural-Damage-In-Right-Knee",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-29T13:28:56",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Drummond_Andre_phi_240627.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282939/Andre-Drummond-Suffered-No-Structural-Damage-In-Right-Knee"
  },
  {
    "title": "UConn Freshman Braylon Mullins Makes Season Debut After Month-Long Ankle Injury",
    "summary": "<p>Top recruit Braylon Mullins played 10 minutes in his season debut for No. 5 UConn on Friday, scoring 2 points in a 74-61 victory over No. 13 Illinois. The freshman guard had missed more than a month after injuring his ankle during practice following an exhibition game in mid-October.</p>\n<p>Mullins checked into the game with about 12 minutes remaining in the first half under a 15-minute restriction. He made one basket in five attempts, a jumper that extended UConn's lead to 63-42 with 11:27 left that drew a loud ovation from Huskies fans.</p>\n<p>UConn forward Alex Karaban expressed confidence that Mullins will continue improving as he gains more game experience. The freshman began fully participating in practices this week after the extended absence.</p>\n<p>\"He's going to continue to get better,\" Karaban said. \"He's going to continue to grow, and he's getting way more comfortable there. What he does in practice, he kills in practice, he's going to get more comfortable there.\"</p>\n<p>Mullins' only previous appearance for the Huskies came Oct. 13 when he scored 12 points in an exhibition against Boston College. He injured his ankle during a subsequent practice and had not played since.</p>\n<p>Mullins is UConn's top recruit in a freshman class that also includes transfers Silas Demary Jr. from Georgia and Malachi Smith from Dayton. The Indiana native averaged 25 points and shot 47 percent from three-point range last season at Greenfield-Central High School. <a href=\"https://basketball.realgm.com/wiretap/282817/Darryn-Peterson-Projected-No-1-Overall-In-ESPNs-First-2026-NBA-Mock-Draft\">ESPN's most recent 2026 mock draft projects Mullins as a late lottery pick</a>.</p>",
    "link": "https://basketball.realgm.com/wiretap/282938/UConn-Freshman-Braylon-Mullins-Makes-Season-Debut-After-Month-Long-Ankle-Injury",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-29T08:19:04",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Logo_Connecticut.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282938/UConn-Freshman-Braylon-Mullins-Makes-Season-Debut-After-Month-Long-Ankle-Injury"
  },
  {
    "title": "Jalen Williams Makes Season Debut As Thunder Improve To 19-1",
    "summary": "<p>Jalen Williams made his season debut Friday night after five months recovering from wrist surgery, scoring 11 points with 8 assists in 29 minutes as the Oklahoma City Thunder defeated the Phoenix Suns 123-119. The victory extended Oklahoma City's winning streak to 11 games and secured their spot in the NBA Cup knockout round.</p>\n<p>Williams underwent surgery in July to repair a torn ligament in his right wrist, followed by a procedure to remove a screw causing irritation. The defending champion Thunder improved to 19-1, becoming the fifth team in NBA history to start a season with that record.</p>\n<p>Williams shot 3-of-12 from the field as he worked to regain his rhythm after the extended absence. The All-Star guard acknowledged the challenge of readjusting to game conditions after such a long layoff.</p>\n<p>\"The goal for tonight was to get in a rhythm, but it's an adjustment,\" Williams said. \"Game 7 was, what, five months ago? Almost six. Trying to adjust to the physicality now was a little different. A lot of it was just rhythm -- trying not to do too much, just finding the spots where I was comfortable five months ago.\"</p>\n<p>Williams said his defensive contributions will come more quickly than his offensive production as he continues recovering from two hand surgeries. He expressed confidence in his conditioning and ability to impact games on that end of the floor.</p>\n<p>\"Defense is easy for me, especially when you lose your right hand for five months,\" Williams said. \"I can always play hard defensively and figure things out from there. Offensively, yeah, it'll take time. I've had two hand surgeries, and I'm still figuring out my jump shot and dribbling. It's a process, but defensively, my feet feel fine, my wind is good.\"</p>\n<p>Williams' absence from the first 19 games makes him ineligible for postseason honors. He can no longer qualify for the $287 million supermax contract kicker in his five-year, $239 million extension.</p>\n<p>Shai Gilgeous-Alexander led Oklahoma City with 37 points, including 15 in the final seven minutes. He has scored at least 20 points in 92 consecutive games, matching Wilt Chamberlain for the second-longest streak in NBA history.</p>",
    "link": "https://basketball.realgm.com/wiretap/282937/Jalen-Williams-Makes-Season-Debut-As-Thunder-Improve-To-19-1",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-29T08:16:07",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Williams_Jalen_okc_250531.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282937/Jalen-Williams-Makes-Season-Debut-As-Thunder-Improve-To-19-1"
  },
  {
    "title": "Anthony Davis Returns After Month-Long Absence As Mavericks Lose To Lakers",
    "summary": "<p>Anthony Davis returned to action Friday night after missing nearly a month with a left calf strain, scoring 12 points in the Dallas Mavericks' 129-119 loss to the Los Angeles Lakers. The 10-time All-Star added five rebounds, five assists and three blocks in 28 minutes, slightly exceeding his planned minutes restriction.</p>\n<p>Davis had been sidelined since Oct. 29 following the calf injury. The Mavericks dropped to 5-15 with the loss, extending their losing streak to seven games and keeping them near the bottom of the Western Conference standings.</p>\n<p>Lakers coach JJ Redick deployed frequent double teams against his former player. Davis shot 6-of-10 from the field but did not attempt a free throw as Los Angeles sent help defenders whenever he touched the ball.</p>\n<p>\"We weren't really trying to force anything,\" Davis said. \"They were kind of double-teaming every time I caught the ball. As soon as I catch it and turn around, it was two guys in my face. I was just trying to make the right play with the pass.\"</p>\n<p>The game marked Davis' first appearance at Crypto.com Arena since the shocking Feb. 2 trade that sent him to Dallas in exchange for Luka Doncic. Lakers fans gave Davis loud applause during pregame introductions.</p>\n<p>Davis will not play Saturday night against the Los Angeles Clippers as Dallas continues taking a cautious approach. The franchise has carefully managed his return after tensions arose over his rehabilitation timeline.</p>\n<p>Davis said he felt ready to return weeks ago and his personal medical staff had cleared him to play against Washington. However, Dallas director of health and performance Johann Bilsborough expressed concern, prompting Mavericks governor Patrick Dumont to delay Davis' return until medical data showed no risk of aggravating the injury.</p>\n<p>\"Any time you're sitting down and you see these guys, especially in close games, you wish you could be out there,\" Davis said. \"As one of the leaders, you want to go out there.\"</p>\n<p>Injuries have limited Davis to just 15 games plus two play-in appearances since the trade. The struggles contributed to general manager Nico Harrison's firing earlier this month. Doncic led the Lakers with 35 points and 11 assists, while Austin Reaves scored 38 points on 12-of-15 shooting.</p>",
    "link": "https://basketball.realgm.com/wiretap/282936/Anthony-Davis-Returns-After-Month-Long-Absence-As-Mavericks-Lose-To-Lakers",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-29T08:11:44",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Davis_Anthony_dal_250208.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282936/Anthony-Davis-Returns-After-Month-Long-Absence-As-Mavericks-Lose-To-Lakers"
  },
  {
    "title": "Giannis Antetokounmpo To Bucks' Teammates: Worry Only About Winning Mentality",
    "summary": "<p>Giannis Antetokounmpo delivered an impassioned message to his Milwaukee Bucks teammates after their seventh consecutive loss, urging them to abandon personal agendas and focus solely on winning. The two-time MVP scored 30 points with 15 rebounds and eight assists in his return from a groin injury, but the Bucks fell 118-109 to the New York Knicks on Friday night.</p>\n<p>Milwaukee has not lost seven straight games since March 2014, Antetokounmpo's rookie season when the team finished 15-67. The Bucks are 8-12 and sit 11th in the Eastern Conference, two games out of a play-in spot.</p>\n<p>\"Nobody should have a personal agenda. Nobody should worry about what they want from themselves,\" said Antetokounmpo, who missed the previous four games with a groin strain. \"Worry only about winning mentality. Winning mindset. The more we can win the games, the more everything takes care of itself.\"</p>\n<p>Antetokounmpo criticized teammates for trying to carry too heavy an offensive load during injuries to him and Kevin Porter Jr. He said players focusing on their individual scoring opportunities undermines team culture and prevents Milwaukee from winning games.</p>\n<p>\"Can I make an excuse that we've played a lot of games and guys are tired and it's a huge load on people? Yeah,\" Antetokounmpo said. \"Can I also make an excuse that's human nature when [Kevin Porter Jr.] goes down and myself goes down, it's human nature to think that you got to carry a load. ... Maybe it's a scoring load, maybe you got to make plays, maybe you think it is your opportunity to get more shots. ... But that's not how you win games. That's not how you build culture.</p>\n<p>\"At the end of the day, you got to come in, do your job, do what you're paid to do, defend ... do the little things. And sometimes, when you worry about doing the little things, all the other things add up. If you're so concerned about scoring the ball and get yourself going offensively and that doesn't work for you, now you feel like you cannot do nothing.\"</p>\n<p>Antetokounmpo said teammates are letting missed shots affect their performance for the rest of games. He emphasized the need to maintain competitive spirit regardless of individual offensive struggles.</p>\n<p>\"You cannot worry about one shot or two shots that you miss, which took four seconds out of the game to dictate 47 minutes, 56 seconds of the game,\" Antetokounmpo said. \"So, we got to get back to that mindset. We got to get into the mindset that we got to compete.\"</p>\n<p>\"We got to move the ball. We got to find open 3s, we got to run. We got to create spacing,\" Antetokounmpo said.</p>\n<p>Antetokounmpo played under a minutes restriction in his first game back from injury. He said he expects to play more minutes Saturday when Milwaukee hosts the Brooklyn Nets in the second half of a back-to-back.</p>",
    "link": "https://basketball.realgm.com/wiretap/282935/Giannis-Antetokounmpo-To-Bucks-Teammates-Worry-Only-About-Winning-Mentality",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-29T08:03:34",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Antetokounmpo_Giannis_mil_250429.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282935/Giannis-Antetokounmpo-To-Bucks-Teammates-Worry-Only-About-Winning-Mentality"
  },
  {
    "title": "NBA Scouts Say Joel Embiid Struggling To Keep Up With Modern Pace Even When Healthy",
    "summary": "<p>Joel Embiid's mobility issues extend beyond his knee problems, with NBA scouts expressing concern that he cannot match the pace of the modern game. An Eastern Conference scout said the Philadelphia 76ers center struggled with the league's speed even before his latest injury, raising questions about his long-term effectiveness.</p>\n<p>\"You look at where the league is heading, with the pace and the speed the game is being played,\" the second East scout said. \"He was having trouble keeping up with it when he was healthy, let alone now.\"</p>\n<p>Embiid has missed more than two weeks with right knee soreness after previously dealing with left knee issues. The ongoing problems underscore the fragile state of his body and have prompted Philadelphia to create a style of play that does not depend on his availability.</p>\n<p>Multiple Eastern Conference executives believe the 76ers must reimagine how they use Embiid rather than building their offense around him. One executive suggested Philadelphia needs to deploy him strategically to maximize his remaining value.</p>\n<p>\"They have to figure out how to maximize Joel,\" a second East executive said. \"I don't think he can come back and look like he used to. They have to try to use him in a strategic way, where he can have some value to them, but you can't build the offense around him.\"</p>\n<p>Embiid's mobility problems have been most apparent on defense, where opposing teams target him when he ventures outside the paint. His lateral movement has deteriorated significantly, limiting his effectiveness in pick-and-roll coverage.</p>\n<p>\"He basically runs from one free throw line to the other,\" an East assistant coach said.</p>\n<p>His rebounding has also declined, another sign of reduced explosiveness. With Embiid sidelined, the 76ers have struggled defensively with Andre Drummond as their only true big man.</p>\n<p>Teams still respect Embiid's scoring ability and gravity in dribble handoff actions with guards Tyrese Maxey, Cooper Edgecombe, Quentin Grimes and Jared McCain. After a poor season debut in Boston, he posted five consecutive games with at least 20 points while shooting 50 percent from the field and 37.5 percent from three-point range.</p>",
    "link": "https://basketball.realgm.com/wiretap/282934/NBA-Scouts-Say-Joel-Embiid-Struggling-To-Keep-Up-With-Modern-Pace-Even-When-Healthy",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-29T07:58:49",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Embiid_Joel_phi_250224.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282934/NBA-Scouts-Say-Joel-Embiid-Struggling-To-Keep-Up-With-Modern-Pace-Even-When-Healthy"
  },
  {
    "title": "Andre Drummond Leaves Sixers' Win With Hyperextended Knee",
    "summary": "<p>Philadelphia Sixers center Andre Drummond was diagnosed with a hyperextended knee, sources told Michael Scotto of HoopsHype.</p>\n<p>Drummond suffered the injury during the Sixers' 115-103 win over the Nets on Friday night.</p>\n<p>Drummond left the game in a wheelchair.</p>\n<p>Drummond is averaging 8.2 points and 10.3 rebounds on the year. </p>",
    "link": "https://basketball.realgm.com/wiretap/282933/Andre-Drummond-Leaves-Sixers-Win-With-Hyperextended-Knee",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-29T01:15:54",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Drummond_Andre_phi_240627.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282933/Andre-Drummond-Leaves-Sixers-Win-With-Hyperextended-Knee"
  },
  {
    "title": "Steph Curry To Be Re-Evaluated In 1 Week With Quad Contusion, Muscle Strain",
    "summary": "<p>Steph Curry will be re-evaluated in one week after being diagnosed with a quad contusion, the Golden State Warriors announced.</p>\n<p>An MRI also revealed a muscle strain.</p>\n<p>Curry suffered the injury during Wednesday night's loss to the Rockets.</p>\n<p>The Warriors are currently 10-10 on the year. </p>",
    "link": "https://basketball.realgm.com/wiretap/282932/Steph-Curry-To-Be-Re-Evaluated-In-1-Week-With-Quad-Contusion-Muscle-Strain",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-29T01:12:44",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Curry_Stephen_gsw_250430.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282932/Steph-Curry-To-Be-Re-Evaluated-In-1-Week-With-Quad-Contusion-Muscle-Strain"
  },
  {
    "title": "Celtics' Bill Chisholm Outbid Rivals By Less Than $100 Million In $6.1B Sale",
    "summary": "<p>Boston Celtics owner Bill Chisholm won control of the franchise by outbidding the second-place suitor by less than $100 million in a blind auction last March. Chisholm's $6.1 billion valuation set a record for an NBA control purchase and North American professional sports franchise sale.</p>\n<p>The lifelong Celtics fan estimated his chances at just one percent when he began pursuing the team. Chisholm paced his Menlo Park office conference room awaiting the call from sale advisor Frank Ghali that would determine if his bid was successful.</p>\n<p>\"It's unlike any other investment or anything really,\" Chisholm said. \"Truly once in a lifetime thing.\"</p>\n<p>Four groups advanced to the final round of bidding in March, including Chisholm, existing minority owner Stephen Pagliuca, Phillies minority owner Stan Middleman and the Friedkin Group. The second-place bidder, believed to be Middleman, offered more than $6 billion. Pagliuca's bid came in at $5.5 billion, according to multiple sources briefed on the negotiations.</p>\n<p>The sale attracted significant attention as the first NBA franchise to hit the market after the league signed its 11-year, $76 billion media rights deal. Boston was also defending its 18th championship when controlling owner Wyc Grousbeck announced the sale in July 2024.</p>\n<p>Chisholm assembled an investor group that included minority investors Rob Hale and Bruce Beal Jr. Private equity firm Sixth Street invested approximately $600 million for a 10 percent stake with no governance rights. The firm holds preferred equity guaranteeing an 8 percent return tied to the franchise's value appreciation.</p>\n<p>Some investors originally aligned with Pagliuca's group joined Chisholm after he won. Alternate governor Aditya Mittal, from one of the world's wealthiest families, is among the ownership group members.</p>\n<p>\"They just wanted to be in the thing,\" Chisholm said. \"And I think everyone sort of assumed Pags was going to win, so they just aligned with Pags.\"</p>\n<p>Wyc Grousbeck maintained an ownership stake as alternate governor after his share fell below the NBA's 15 percent minimum threshold for lead governor. The NBA approved the deal in August. Grousbeck didn't want to sell his family's stake in the franchise, but was overruled by his siblings and eventually supported his father Irv Grousbeck's decision.</p>",
    "link": "https://basketball.realgm.com/wiretap/282931/Celtics-Bill-Chisholm-Outbid-Rivals-By-Less-Than-$100-Million-In-$61B-Sale",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-28T08:07:06",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_bostonceltics.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282931/Celtics-Bill-Chisholm-Outbid-Rivals-By-Less-Than-$100-Million-In-$61B-Sale"
  },
  {
    "title": "Anthony Edwards Embraces Point Guard Role As Timberwolves Adapt Without Traditional One",
    "summary": "<p>Anthony Edwards is transitioning into a full-time point guard role as the team moves away from traditional floor generals. Edwards scored 31 points with eight rebounds and five assists in a 111-105 loss to the Oklahoma City Thunder on Wednesday night.</p>\n<p>Timberwolves coach Chris Finch confirmed the shift before the Western Conference finals rematch. He explained that Edwards has become Minnesota's primary ball handler despite Donte DiVincenzo starting at point guard.</p>\n<p>\"Anthony's probably more of our point guard than Donte is our point guard,\" Finch said. \"He has the ball. He is our lead guard in that regard.\"</p>\n<p>Edwards acknowledged he is still adjusting to the responsibilities of initiating offense and handling late-game pressure. The sixth-year guard struggled with decision-making in crucial moments, including a late-game sequence where he failed to make himself available for an inbound pass.</p>\n<p>\"I just got to get used to being a point guard, going to get the rock at the end of the game, bringing it up, even though they pressure,\" Edwards said.</p>\n<p>\"Sometimes I'm thinking, let somebody bring it up and then come get it,\" Edwards said. \"Just to take the pressure off my teammates, I just got to bring the ball up the court and get us into an action.\"</p>\n<p>The Timberwolves lack viable point guard options with Mike Conley declining at age 38. Conley went 1-for-4 against the Thunder and Minnesota was outscored by 17 points in his 12:32 on court. Rob Dillingham, at 20 years old, is not ready for significant minutes in the role. <a href=\"https://basketball.realgm.com/wiretap/282920/Wolves-Emerging-As-Expected-Buyers-Ahead-Of-Trade-Deadline\">The Wolves are emerging with motivation on the trade market due to their need at the position</a>.</p>\n<p>Edwards has scored 41, 43 and 31 points in his last three games while increasing his playmaking responsibilities. Finch noted Edwards is handling double teams better than last season, though the team must find ways to reduce the defensive pressure he faces.</p>\n<p>\"With no designated point guard, I think I got to be the one to bring the ball up,\" Edwards said. \"It's just that simple, so we don't turn it over, get us into action, get my teammates shots.\"</p>",
    "link": "https://basketball.realgm.com/wiretap/282930/Anthony-Edwards-Embraces-Point-Guard-Role-As-Timberwolves-Adapt-Without-Traditional-One",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-28T08:00:54",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Edwards_Anthony_min_251104.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282930/Anthony-Edwards-Embraces-Point-Guard-Role-As-Timberwolves-Adapt-Without-Traditional-One"
  },
  {
    "title": "NBA Net Rating (Week 5): Raptors Climb To No. 4, First In Eastern Conference",
    "summary": "<p>The Toronto Raptors rank fourth in the <a href=\"https://basketball.realgm.com/nba/team-stats/2026/Advanced_Stats/Team_Totals/Regular_Season/drtg/desc\">NBA in Net Rating</a> and lead the Eastern Conference at +6.6 points per 100 possessions. The Oklahoma City Thunder continue to rank first with +16.6 points per 100 possessions while both the Houston Rockets and Denver Nuggets are above +10.0.</p>\n<p><span style=\"text-decoration: underline;\"><strong>NBA Net Rating (Week 5):</strong></span><br />1. Thunder: 16.2<br />2. Rockets: 10.9<br />3. Nuggets: 10.0<br />4. Raptors: 6.6<br />5. Knicks: 6.5<br />6. Spurs: 6.5<br />7. Pistons: 6.4<br />8. Heat: 5.5<br />9. Magic: 5.3<br />10. Celtics: 4.7<br />11. Wolves: 4.6<br />12. Suns: 4.2<br />13. Cavaliers: 3.9<br />14. Lakers: 3.5<br />15. Hawks: 1.8<br />16. Warriors: 0.6<br />17. Sixers: -1.0<br />18. Blazers: -2.6<br />19. Bulls: -2.8<br />20. Bucks: -2.8<br />21. Grizzlies: -4.1<br />22. Hornets: -5.6<br />23. Mavericks: -5.7<br />24. Clippers: -6.2<br />25. Jazz: -7.2<br />26. Nets: -10.7<br />27. Pelicans: -11.0<br />28. Kings: -11.2<br />29. Pacers: -11.5<br />30. Wizards: -13.6</p>",
    "link": "https://basketball.realgm.com/wiretap/282929/NBA-Net-Rating-Week-5-Raptors-Climb-To-No-4-First-In-Eastern-Conference",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-28T07:56:10",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Ingram_Brandon_tor_251103.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282929/NBA-Net-Rating-Week-5-Raptors-Climb-To-No-4-First-In-Eastern-Conference"
  },
  {
    "title": "Jalen Williams Set For Season Debut On Friday Against Suns",
    "summary": "<p>Oklahoma City Thunder All-NBA guard Jalen Williams will make his season debut Friday night against the Phoenix Suns after recovering from right wrist surgery. Williams underwent an initial procedure in July, followed by a screw removal on Oct. 31, after playing through a torn ligament during last season's championship run.</p>\n<p>The Thunder have dominated opponents with an 18-1 record to open the season. Oklahoma City posted the best point differential through 19 games in NBA history at plus-16.5, becoming only the fifth team ever to start 18-1.</p>\n<p>Williams emerged as one of the league's elite two-way players last season, averaging 21.6 points, 5.3 rebounds, 5.1 assists and 1.6 steals per game. He joined Cleveland's Evan Mobley as the only players to earn both All-NBA and All-Defense honors.</p>\n<p>Williams led the NBA in points per direct isolation allowed and ranked in the top five for points per direct drive allowed, per GeniusIQ. He joined an exclusive group of four players with 1,400 points, 300 rebounds, 300 assists and 100 steals last season, alongside Nikola Jokic, teammate Shai Gilgeous-Alexander and James Harden.</p>\n<p>The Thunder plan to carefully manage Williams' return after handling Chet Holmgren's three-month absence last season. Holmgren returned in February from a hip injury and gradually regained form before the playoffs.</p>\n<p>Ajay Mitchell has filled Williams' role effectively, averaging 15.9 points, 3.6 assists and 1.7 steals. Isaiah Joe has contributed a career-high 13.2 points while shooting 40.2% from three-point range on over seven attempts per game.</p>\n<p>Williams missed the first 19 games and is now ineligible for regular season award honors. The absence eliminates his eligibility for the $287 million super maximum contract escalator in his five-year, $239 million extension.</p>",
    "link": "https://basketball.realgm.com/wiretap/282928/Jalen-Williams-Set-For-Season-Debut-On-Friday-Against-Suns",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-28T07:51:04",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Williams_Jalen_okc_250617.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282928/Jalen-Williams-Set-For-Season-Debut-On-Friday-Against-Suns"
  },
  {
    "title": "Mavs Not Looking To Trade Kyrie Irving; More Likely To Move Anthony Davis",
    "summary": "<p>On a recent episode of ESPN's Howdy Partners, which covers Texas NBA teams, NBA insider Tim MacMahon gave insight into the Dallas Mavericks trade plans. MacMahon said the Mavs do not want to trade guard Kyrie Irving. Dallas is willing, and maybe even likely, to trade big man Anthony Davis.</p>\n<p>\"What I would tell you about Kyrie is the Mavericks do not want to trade him,\" MacMahon said about Dallas' openness to moving on from their veteran point guard.</p>\n<p>When it comes to trading Davis, MacMahon said that's far more likely than a trade involving Irving.</p>\n<p>\"Trading AD is a real possibility-and I would even say likelihood-this season,\" MacMahon said. \"Trading Kyrie is not something that's on the Mavericks' priority list, or it's just straight up not something that they are interested in doing right now.\"</p>",
    "link": "https://basketball.realgm.com/wiretap/282927/Mavs-Not-Looking-To-Trade-Kyrie-Irving;-More-Likely-To-Move-Anthony-Davis",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-27T11:11:27",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Irving_Kyrie_dal_250206.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282927/Mavs-Not-Looking-To-Trade-Kyrie-Irving;-More-Likely-To-Move-Anthony-Davis"
  },
  {
    "title": "Jusuf Nurkic Expected To Generate Trade Interest Due To Strong Play",
    "summary": "<p>Jusuf Nurkic is expected to generate trade interest from around the league due to his play for the Utah Jazz this season, according to Jake Fischer of The People's Insider.</p>\n<p>Nurkic is averaging 7.5 points and 9.6 rebounds for the Jazz on the year.</p>\n<p>Nurkic is in the final year of his deal worth $19.3 million. </p>\n<p>The Jazz are currently 5-12 this season. </p>",
    "link": "https://basketball.realgm.com/wiretap/282926/Jusuf-Nurkic-Expected-To-Generate-Trade-Interest-Due-To-Strong-Play",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-27T01:42:56",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Nurkic_Jusuf_uta_251103.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282926/Jusuf-Nurkic-Expected-To-Generate-Trade-Interest-Due-To-Strong-Play"
  },
  {
    "title": "Blazers More Willing To Trade Robert Williams III This Season",
    "summary": "<p>The Portland Trail Blazers are more willing to trade Robert Williams III this season than in previous years, according to Jake Fischer of The People's Insider.</p>\n<p>The Blazers have had a high asking price in exchange for Williams. </p>\n<p>The Blazers acquired Williams from the Celtics in a deal involving Jrue Holiday in 2023.</p>\n<p>Williams is currently in the final year of his contract worth $13.3 million. </p>",
    "link": "https://basketball.realgm.com/wiretap/282925/Blazers-More-Willing-To-Trade-Robert-Williams-III-This-Season",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-27T01:39:19",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Williams_Robert_por_241202.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282925/Blazers-More-Willing-To-Trade-Robert-Williams-III-This-Season"
  },
  {
    "title": "Nick Richards Remains Available For Trade",
    "summary": "<p>The Phoenix Suns have had Nick Richards available for a trade since this past summer, according to Jake Fischer of The People's Insider.</p>\n<p>Richards is averaging 4.1 points and 3.8 rebounds on the season.</p>\n<p>The Suns acquired Richards last January from the Hornets.</p>\n<p>The Suns are 12-7 on the season.</p>",
    "link": "https://basketball.realgm.com/wiretap/282924/Nick-Richards-Remains-Available-For-Trade",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-27T01:34:54",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Richards_Nick_phx_250123.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282924/Nick-Richards-Remains-Available-For-Trade"
  },
  {
    "title": "Steph Curry Leaves Warriors' Loss With Quad Contusion, Will Undergo MRI",
    "summary": "<p>Steph Curry left the Golden State Warriors' 104-100 loss to the Houston Rockets with a quad contusion with just over four minutes left in the fourth quarter.</p>\n<p>Curry is set to undergo an MRI.</p>\n<p>Curry appeared to suffer the injury while running into a screen set by Alperen Sengun.</p>\n<p>Curry had 14 points at the time of the injury.</p>",
    "link": "https://basketball.realgm.com/wiretap/282923/Steph-Curry-Leaves-Warriors-Loss-With-Quad-Contusion-Will-Undergo-MRI",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-27T01:31:05",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Curry_Stephen_gsw_250430.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282923/Steph-Curry-Leaves-Warriors-Loss-With-Quad-Contusion-Will-Undergo-MRI"
  },
  {
    "title": "Warriors Recall Jonathan Kuminga, De'Anthony Melton, Gui Santos From G League",
    "summary": "<p>The Golden State Warriors recalled Jonathan Kuminga, De'Anthony Melton, and Gui Santos from the G League's Santa Cruz Warriors on Wednesday night.</p>\n<p>The three players took part in a scrimmage with the G League team earlier in the day.</p>\n<p>Kuminga has missed the last seven games <a href=\"https://basketball.realgm.com/wiretap/282904/MRI-Reveals-No-Structural-Damage-To-Jonathan-Kumingas-Knees\">with a knee injury</a>.</p>\n<p><a href=\"https://x.com/NickFriedell/status/1993853572786868672\">Kerr was encouraged</a> by both Kuminga and Melton in the scrimmage. </p>\n<p>Melton is currently rehabbing from a torn ACL. </p>",
    "link": "https://basketball.realgm.com/wiretap/282922/Warriors-Recall-Jonathan-Kuminga-DeAnthony-Melton-Gui-Santos-From-G-League",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-27T01:26:19",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Kuminga_Jonathan_gsw_241017.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282922/Warriors-Recall-Jonathan-Kuminga-DeAnthony-Melton-Gui-Santos-From-G-League"
  },
  {
    "title": "Cade Cunningham's 42 Points Not Enough As Pistons Fall Short Of Breaking Franchise Win Streak Record",
    "summary": "<p>The Detroit Pistons' franchise record-tying 13-game winning streak ended Wednesday night with a 117-114 loss to the Boston Celtics, as Cade Cunningham's 42-point performance fell short. The Eastern Conference-leading Pistons missed a chance to surpass the records set by their 1989-90 and 2003-04 championship teams.</p>\n<p>Jaylen Brown scored 33 points and Derrick White added 27 for Boston, with White scoring 11 in the final four-and-a-half minutes. Brown also grabbed 10 rebounds as the Celtics won their fifth game in six outings.</p>\n<p>With Detroit trailing by three, Cunningham was fouled near midcourt while attempting a 3-pointer. After a review, officials ruled he was in the act of shooting and awarded three free throws.</p>\n<p>Cunningham made the first two free throws but missed the third with 2.4 seconds remaining. Payton Pritchard grabbed the rebound for Boston, was fouled, and hit two free throws to seal the victory.</p>\n<p>Boston then stole a pass before Detroit could attempt a potential tying 3-pointer.</p>\n<p>Cunningham expressed disappointment while emphasizing the team's focus on the remainder of the season after the heartbreaking loss.</p>\n<p>\"We all wanted it tonight, we all wanted 14 wins,\" Cunningham said. \"I'm not gonna act like it didn't mean anything to us. It's a big deal, we all wanted to be on that side of history, but it didn't happen.\"</p>\n<p>\"We can't go back. I can't shoot the free throw again. We can't get up on 3s again. The game is over with. It's about how we're going to respond. It's a lot of season left to go accomplish a lot of great things and that's where our mind is at,\" Cunningham added.</p>\n<p>The Pistons are 15-3 this season, a stunning turnaround after losing 28 consecutive games two seasons ago to break the NBA single-season record. Detroit had defeated Indiana on Monday to match the franchise record for consecutive victories.</p>\n<p>J.B. Bickerstaff acknowledged room for improvement despite his team's strong start to the season.</p>\n<p>\"We understand it's one game, and we understand also that we didn't play our best basketball,\" Bickerstaff said. \"There were things that we could've done better, and we still put ourselves in position to have a shot at it at the end of the game.\"</p>\n<p>The loss snapped Detroit's winning streak but the Pistons remain atop the Eastern Conference standings with their best start in decades.</p>",
    "link": "https://basketball.realgm.com/wiretap/282921/Cade-Cunninghams-42-Points-Not-Enough-As-Pistons-Fall-Short-Of-Breaking-Franchise-Win-Streak-Record",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-26T21:51:10",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Cunningham_Cade_det_250428.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282921/Cade-Cunninghams-42-Points-Not-Enough-As-Pistons-Fall-Short-Of-Breaking-Franchise-Win-Streak-Record"
  },
  {
    "title": "Wolves Emerging As Expected Buyers Ahead Of Trade Deadline",
    "summary": "<p>The Minnesota Timberwolves are expected to be among the more aggressive teams leading to the 2026 NBA trade deadline. Tim Connelly has a reputation for being one of the more active lead decision-makers throughout his tenures with the Wolves and the Denver Nuggets. Minnesota pursued a trade for Kevin Durant, for example, at last year's trade deadline and again in the offseason.</p>\n<p>\"As I'm discussing the beginning of the idea of what the trade market may look like in the NBA, there's some sellers you can identify,\" <a href=\"https://www.youtube.com/playlist?list=PLu1neCd4swuakibtwr6887z4D8YH3YUnK\">said Brian Windhorst on Wednesday's Hoop Collective Podcast</a>. \"But a team that is emerging as a buyer is the Wolves.</p>\n<p>\"Coming off two Conference Finals, high expectations, weak at the guard position for various reasons. A team that despite having a decent record, has underachieved because they've gone through a soft portion of the schedule.\"</p>\n<p>Minnesota attempted to address their long-term need at point guard beyond Mike Conley by acquiring Rob Dillingham at the 2024 NBA draft when they sent a future first round pick and a pick swap to the San Antonio Spurs.</p>\n<p><a href=\"https://basketball.realgm.com/nba/draft/future_drafts/tradeable\">The Wolves don't currently have a tradeable first round pick</a>.</p>",
    "link": "https://basketball.realgm.com/wiretap/282920/Wolves-Emerging-As-Expected-Buyers-Ahead-Of-Trade-Deadline",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-26T21:36:10",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Connelly_Tim_den_220523.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282920/Wolves-Emerging-As-Expected-Buyers-Ahead-Of-Trade-Deadline"
  },
  {
    "title": "Anthony Davis Addresses Trade Speculation: 'Whatever Comes Out Of That, Comes Out Of That'",
    "summary": "<p>Anthony Davis dismissed trade speculation Wednesday, saying his focus remains on basketball despite uncertainty surrounding his future following the firing of general manager Nico Harrison. Davis said he has no control over front office decisions but maintains open communication with management.</p>\n<p>Davis participated in a full practice Wednesday for the first time since suffering a calf strain October 29. He will be listed as questionable for Friday's game against the Los Angeles Lakers, his former team.</p>\n<p>With Harrison's departure and Dallas sitting at 5-14, speculation has emerged about Davis' future ahead of the February 5 trade deadline. The franchise must decide whether to keep the roster intact or prioritize building around rookie Cooper Flagg.</p>\n<p>\"Man, look. Y'all make it like we're going to war or something. This is basketball. It comes with it,\" Davis said. \"I think everybody in their career has been involved in trade talks, or been traded or some type of move. That doesn't affect me.\"<br />Davis emphasized his job is to perform on the court and lead the team when healthy.</p>\n<p>\"My job is to do what I do when I'm on the floor, play basketball and try to lead this team,\" Davis said. \"Whatever comes out of that, comes out of that. I don't really have any control over that, but I do have an open line of communication with the front office and I'm just ready to get back on the floor.\"</p>\n<p>Harrison was relieved of his duties on November 11th amid the team's worst start since the 2017-18 season. Harrison had acquired Davis in a stunning trade that sent Luka Doncic to the Lakers last season.</p>\n<p>\"It was surprising more than anything,\" Davis said. \"Nico's my guy. Obviously, he played a huge part of getting me here and wanting me to fulfill his vision.\"</p>\n<p>The Mavericks have gone 3-11 without Davis over four weeks and sit at the bottom of the Western Conference. Davis was averaging 20.8 points and 10.2 rebounds before his injury.</p>\n<p>Dallas ranks third in defense despite missing Davis and Dereck Lively II for most of the season but ranks 30th in offense. Jason Kidd cited Davis' rebounding, scoring and leadership as critical needs for the struggling franchise.</p>",
    "link": "https://basketball.realgm.com/wiretap/282919/Anthony-Davis-Addresses-Trade-Speculation-Whatever-Comes-Out-Of-That-Comes-Out-Of-That",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-26T21:28:29",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Davis_Anthony_dal_250208.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282919/Anthony-Davis-Addresses-Trade-Speculation-Whatever-Comes-Out-Of-That-Comes-Out-Of-That"
  },
  {
    "title": "How Author Robert Caro's 'Turn Every Page' Philosophy Inspired Sam Presti's Thunder Build",
    "summary": "<p>Oklahoma City Thunder general manager Sam Presti has repeatedly cited historian Robert Caro's research philosophy as inspiration for building the franchise's first NBA championship team. Presti referenced Caro's mantra to \"turn every page\" multiple times during his annual preseason news conference in September.</p>\n<p>Five days before the Thunder opened training camp following their title victory, Presti delivered his traditional lengthy media session. He discussed the team's approach to the season while invoking Caro's exhaustive research methods as a guiding principle.</p>\n<p>Presti first publicly mentioned Caro in 2020 while reading \"Master of the Senate\" during the NBA bubble. In his September 2024 opening statement, he applied Caro's philosophy to team-building and roster management.</p>\n<p>\"One of my favorite authors, Robert Caro, has a great saying about research, where he says, 'You have to turn every single page,' and I really like that relative to what it is that we have to do in order to discover the team,\" Presti said.</p>\n<p>\"We have to really understand and go through every iteration to ensure that we're not shutting off potential pathways that could really help us or get us to another level, whether it's now or in the future. ... I think by turning every page, you give yourself every opportunity.\"</p>\n<p>The Thunder GM repeated the phrase throughout the news conference when discussing roster depth, midseason trades, and the team's commitment to staying curious. Presti emphasized that exceptional teams must be willing to explore every possibility.</p>\n<p>Caro, 90, told ESPN he was honored by Presti's admiration. The two-time Pulitzer Prize winner has worked since 1974 on a multivolume biography of President Lyndon Johnson.</p>\n<p>\"I am truly touched, if you want to know the truth,\" Caro said.</p>\n<p>The historian developed his \"turn every page\" philosophy in 1959 while working at Newsday. His managing editor Alan Hathaway instructed him to never assume anything during investigative reporting. That principle has shaped Caro's six-decade career.</p>\n<p>Caro, a lifelong basketball fan who attended New York Knicks championship games in 1970 and 1973, said he receives letters from people who have adopted his motto. Regarding the Thunder's title, he noted that players and coaches win championships, not authors.</p>\n<p>\"I love basketball,\" Caro says. \"I'm not very good at it, but I love it.\"</p>",
    "link": "https://basketball.realgm.com/wiretap/282918/How-Author-Robert-Caros-Turn-Every-Page-Philosophy-Inspired-Sam-Prestis-Thunder-Build",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-26T18:52:07",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Presti_Sam_okc_230613.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282918/How-Author-Robert-Caros-Turn-Every-Page-Philosophy-Inspired-Sam-Prestis-Thunder-Build"
  },
  {
    "title": "Landry Shamet Out At Least Four Weeks With Shoulder Sprain",
    "summary": "<p>Landry Shamet will be out at least four weeks with a right shoulder sprain. Shamet suffered the injury in Sunday's game against the Orlando Magic.</p>\n<p>Shamet has already begun the rehab process on his ailing shoulder.</p>\n<p>Shamet is shooting 42.4 percent on three-pointers this season with the New York Knicks.</p>",
    "link": "https://basketball.realgm.com/wiretap/282917/Landry-Shamet-Out-At-Least-Four-Weeks-With-Shoulder-Sprain",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-26T18:46:57",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Shamet_Landry_nyk_241011.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282917/Landry-Shamet-Out-At-Least-Four-Weeks-With-Shoulder-Sprain"
  },
  {
    "title": "RJ Barrett Out At Least One Week With Sprained Knee",
    "summary": "<p>Toronto Raptors wing RJ Barrett will miss at least one week due to a sprained right knee. Barrett was injured during Toronto's victory over the Brooklyn Nets on Sunday.</p>\n<p>The veteran wing had started the Raptors 17 games, before missing Monday's win over the Cleveland Cavaliers. Barrett underwent imaging that showed no structural damage to his knee.</p>\n<p>For the season, Barrett is averaging 19.4 points, 4.8 rebounds and 3.8 assists per game. Barrett is also shooting a career-best 50.6% from the field.</p>",
    "link": "https://basketball.realgm.com/wiretap/282916/RJ-Barrett-Out-At-Least-One-Week-With-Sprained-Knee",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-26T10:08:00",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Barrett_RJ_tor_240122.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282916/RJ-Barrett-Out-At-Least-One-Week-With-Sprained-Knee"
  },
  {
    "title": "Caitlin Clark, Paige Bueckers, Angel Reese To Make USA Basketball Debuts",
    "summary": "<p>Caitlin Clark, Paige Bueckers, Angel Reese, and JuJu Watkins are among 10 players who will make their senior debuts at USA Basketball training camp next month.</p>\n<p>The camp will feature 18 players, including former Olympians Chelsea Gray, Brittney Griner, Kelsey Plum, Jackie Young and Kahleah Copper.</p>\n<p>Cameron Brink, Lauren Betts, Sonia Citron, Kiki Iriafen, Rickea Jackson and Veronica Burton round out the rest of the group making their debuts.</p>\n<p>Watkins will not participate as she continues to rehab a torn ACL.</p>\n<p>Kara Lawson will lead the training camp, with Natalie Nakase, Nate Tibbetts and Stephanie White serving as assistants. </p>",
    "link": "https://basketball.realgm.com/wiretap/282915/Caitlin-Clark-Paige-Bueckers-Angel-Reese-To-Make-USA-Basketball-Debuts",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-26T01:49:55",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Clark_Caitlin_ind_240520.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282915/Caitlin-Clark-Paige-Bueckers-Angel-Reese-To-Make-USA-Basketball-Debuts"
  },
  {
    "title": "Bill Self 'Hopeful' Darryn Peterson Will Return Soon",
    "summary": "<p>Bill Self said that Darryn Peterson was being more active and that he was \"hopeful\" the guard would return soon from his hamstring injury.</p>\n<p>\"I am hopeful that it's soon,\" Self said. \"He's doing more every day. He's working out [in Las Vegas]. He's running, He's cutting. He's got to test out some things, which we'll test again when we get back [to Lawrence]. So, it's week-to-week.</p>\n<p>\"That may be too long. It's more of every three or four days, we will reevaluate and see.\"</p>\n<p>Peterson is averaging 21.5 points in two games this season.</p>\n<p> </p>",
    "link": "https://basketball.realgm.com/wiretap/282914/Bill-Self-Hopeful-Darryn-Peterson-Will-Return-Soon",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-26T01:44:05",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Peterson_Darryn_ku_251105.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282914/Bill-Self-Hopeful-Darryn-Peterson-Will-Return-Soon"
  },
  {
    "title": "MRI On Deandre Ayton Knee Returns Clean, Reveals Swelling",
    "summary": "<p>An MRI on Los Angeles Lakers center Deandre Ayton's knee returned clean but revealed swelling, according to coach JJ Redick. </p>\n<p>Redick was hopeful that Ayton could return later this week.</p>\n<p>Ayton is averaging 15.5 points and 8.4 rebounds on the season. </p>",
    "link": "https://basketball.realgm.com/wiretap/282913/MRI-On-Deandre-Ayton-Knee-Returns-Clean-Reveals-Swelling",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-26T01:30:31",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Ayton_Deandre_lal_251025.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282913/MRI-On-Deandre-Ayton-Knee-Returns-Clean-Reveals-Swelling"
  },
  {
    "title": "Dylan Harper Upgraded To Questionable For Wednesday",
    "summary": "<p>The San Antonio Spurs upgraded Dylan Harper to questionable for Wednesday's game against the Portland Trail Blazers.</p>\n<p>Harper has been out with a left calf strain suffered on November 2.</p>\n<p>The 19-year-old is averaging 14 points and 4 rebounds on the season. </p>",
    "link": "https://basketball.realgm.com/wiretap/282912/Dylan-Harper-Upgraded-To-Questionable-For-Wednesday",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-26T01:26:52",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Harper_Dylan_sas_251023.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282912/Dylan-Harper-Upgraded-To-Questionable-For-Wednesday"
  },
  {
    "title": "Ron Harper Jr. Named G League Player Of The Week",
    "summary": "<p>Ron Harper Jr. has been named the G League Player of the Week for games played between November 17th and November 23rd. Harper is on a Two-Way contract with the Boston Celtics. </p>\n<p>Harper averaged 36.0 points, 7.0 assists and 6.0 rebounds for the Maine Celtics as they went 2-0.</p>\n<p>Harper has also appeared in three NBA games this season.</p>",
    "link": "https://basketball.realgm.com/wiretap/282911/Ron-Harper-Jr-Named-G-League-Player-Of-The-Week",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-25T15:09:57",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/gleague_logo.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282911/Ron-Harper-Jr-Named-G-League-Player-Of-The-Week"
  },
  {
    "title": "Giannis Antetokounmpo Nears Return After Pregame Workout Before Portland Loss",
    "summary": "<p>Giannis Antetokounmpo completed a pregame workout before the Milwaukee Bucks' 115-103 loss to the Portland Trail Blazers on Monday, signaling his return from a left adductor strain is imminent. The Bucks have dropped five consecutive games and three straight without their star forward on the floor.</p>\n<p>Doc Rivers told reporters both Antetokounmpo and point guard Kevin Porter Jr. are \"pretty close\" to returning. However, both players were ruled out Sunday afternoon for Monday's game against the Trail Blazers.</p>\n<p>Portland dominated Milwaukee despite playing on the second night of a back-to-back. The Trail Blazers led by as many as 33 points in the fourth quarter before the final margin settled at 12.</p>\n<p>Milwaukee's offense has cratered during Antetokounmpo's absence. The Bucks have plummeted to 26th in offensive rating over the last three games at 108.6 points per 100 possessions, down from 16th through the first 15 games.</p>\n<p>Defenses have focused on neutralizing Ryan Rollins, Milwaukee's breakout performer early this season. Portland assigned 6-foot-8 All-Defensive Second Team guard Toumani Camara to pressure Rollins full court.</p>\n<p>\"They're taking Ryan out of it,\" Rivers said after Monday's loss. \"We don't have the ability right now to get into anything else when he doesn't have it.\"</p>\n<p>Rollins finished with 10 points, five rebounds and seven assists but never established rhythm. Milwaukee's offensive rebounding has dropped to 17.8 percent over three games without Antetokounmpo, down from an already league-worst 23.9 percent.</p>",
    "link": "https://basketball.realgm.com/wiretap/282910/Giannis-Antetokounmpo-Nears-Return-After-Pregame-Workout-Before-Portland-Loss",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-25T14:36:34",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Antetokounmpo_Giannis_mil_250214.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282910/Giannis-Antetokounmpo-Nears-Return-After-Pregame-Workout-Before-Portland-Loss"
  },
  {
    "title": "Dereck Lively II Facing Extended Absence Due To Foot Injury",
    "summary": "<p>Dereck Lively II is expected to be out for an extended period. Lively has appeared in only seven of 19 games so far this season with the Dallas Mavericks after undergoing offseason foot surgery and having a recent knee issue. Lively didn't play for the Mavericks on Monday due to foot injury management as he has been experiencing swelling and discomfort.</p>\n<p>Lively is averaging 4.3 points, 5.3 rebounds, 1.9 assists and 1.6 blocks in 16.5 minutes this season. Lively has been limited to just 55 games as a rookie and 36 games last season due to injury issues.</p>\n<p>Lively underwent surgery in the offseason to remove bone spurs from his right foot. Lively will be reevaluated in seven to 10 days.</p>",
    "link": "https://basketball.realgm.com/wiretap/282909/Dereck-Lively-II-Facing-Extended-Absence-Due-To-Foot-Injury",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-25T14:08:36",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Lively_Dereck_dal_231030.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282909/Dereck-Lively-II-Facing-Extended-Absence-Due-To-Foot-Injury"
  },
  {
    "title": "LeBron James Remains Undecided On Playing Past This Season",
    "summary": "<p>Los Angeles Lakers forward LeBron James recently returned to the lineup. James had missed the Lakers first 14 games while battling sciatica.</p>\n<p>For now, James is happy to be back in the lineup, while referring to these games as his \"preseason\" as far as his conditioning goes. As for the future, James remains undecided if he'll continue to play beyond this season.</p>\n<p>The NBA's all-time leading scorer is in the final season of his contract. James will be a free agent after this season, as he is not eligible to sign a contract extension. If this is James' final season, he could feel responsibility for suiting up to play in every game he's healthy for through the end of the season.</p>",
    "link": "https://basketball.realgm.com/wiretap/282907/LeBron-James-Remains-Undecided-On-Playing-Past-This-Season",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-25T09:45:25",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/James_LeBron_lal_240515.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282907/LeBron-James-Remains-Undecided-On-Playing-Past-This-Season"
  },
  {
    "title": "Suns Minority Owners Accuse Mat Ishbia Of Fraud, Missed Capital Call Deadline",
    "summary": "<p>Two Phoenix Suns minority owners have accused majority owner Mat Ishbia of fraud and using the team as his \"personal piggy bank,\" alleging he failed to meet a June capital call deadline in a court filing Monday.</p>\n<p>Kisco WC Sports II and Kent Circle Investments claim Ishbia missed his own deadline to fund a June 2 capital call. They allege he attempted to conceal the missed deadline from other owners before partially funding his share on June 9.</p>\n<p>The minority owners claim Ishbia converted a prior loan into equity to fund his contribution. They say he did not disclose the missed deadline because the operating agreement would have required him to offer minority owners the chance to buy unfunded units, potentially diluting his stake.</p>\n<p>\"We believe the evidence will show that Mr. Ishbia contrived a scheme to threaten our clients with massive dilution of their interests in the Suns if they failed to fund a capital call within ten days' notice, while at the same time hiding his own failure to fund by the deadline,\" said Michael Carlinsky, attorney for the minority owners.</p>\n<p>An Ishbia spokesman told Front Office Sports the contribution was \"timely\" and that the minority owners' argument represents \"a nonsensical rejection of money that he contributed through an appropriate debt to equity conversion.\"</p>\n<p>The Suns called the lawsuit \"a shameless shakedown dressed up as legal process\" in a statement. The team maintains Ishbia has invested hundreds of millions into the franchise and community.</p>\n<p>The filing alleges multiple instances of self-dealing, including a loan to the team at above-market rates. It also cites the sale of arena naming rights to Ishbia's company, United Wholesale Mortgage, without informing minority owners.</p>\n<p>The 10-year naming rights deal for the Mortgage Matchup Center was announced last month at nearly $115 million. The Suns defended the agreement as \"one of the largest in the NBA and no different than what other owners have done.\"</p>\n<p>The legal dispute began in August when the minority owners filed suit alleging mismanagement and lack of transparency. Ishbia countersued in October.</p>",
    "link": "https://basketball.realgm.com/wiretap/282906/Suns-Minority-Owners-Accuse-Mat-Ishbia-Of-Fraud-Missed-Capital-Call-Deadline",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-25T07:41:32",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Ishbia_Mat_phx_230227.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282906/Suns-Minority-Owners-Accuse-Mat-Ishbia-Of-Fraud-Missed-Capital-Call-Deadline"
  },
  {
    "title": "MRI Reveals No Structural Damage To Jonathan Kuminga's Knees",
    "summary": "<p>An MRI on Jonathan Kuminga's knees returned clean and revealed no structural damage, sources told Anthony Slater of ESPN on Monday.</p>\n<p>Kuminga missed his sixth straight game on Monday due to bilateral knee tendinitis.</p>\n<p>Kuminga had been reporting soreness in his knees for the past two weeks. </p>\n<p>The Warriors were hopeful Kuminga would scrimmage on Sunday, though he remained out.</p>\n<p>Steve Kerr admitted that he has \"<a href=\"https://basketball.realgm.com/wiretap/282895/Steve-Kerr-No-Idea-When-Jonathan-Kuminga-Will-Return-From-Knee-Tendonitis\">no idea</a>\" when Kuminga would return. </p>",
    "link": "https://basketball.realgm.com/wiretap/282904/MRI-Reveals-No-Structural-Damage-To-Jonathan-Kumingas-Knees",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-25T03:16:57",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Kuminga_Jonathan_gsw_241017.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282904/MRI-Reveals-No-Structural-Damage-To-Jonathan-Kumingas-Knees"
  },
  {
    "title": "Lakers Sign Drew Timme To Two-Way Contract, Waive Christian Koloko",
    "summary": "<p>The Los Angeles Lakers signed Drew Timme to a two-way deal, Shams Charania of ESPN reported on Monday.</p>\n<p>Timme averaged 25.5 points and 7.5 rebounds for the South Bay Lakers in the G League this season.</p>\n<p>The Lakers waived Christian Koloko to make room for Timme's two-way deal.</p>\n<p>The Lakers also announced that Deandre Ayton will miss Tuesday's game with a knee contusion. </p>",
    "link": "https://basketball.realgm.com/wiretap/282903/Lakers-Sign-Drew-Timme-To-Two-Way-Contract-Waive-Christian-Koloko",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-25T03:11:14",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_losangeleslakers.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282903/Lakers-Sign-Drew-Timme-To-Two-Way-Contract-Waive-Christian-Koloko"
  },
  {
    "title": "Jordan Poole Cleared For Basketball Activities; Herb Jones Out At Least One Week With Calf Strain",
    "summary": "<p>Jordan Poole has been cleared to resume on-court basketball activities, the New Orleans Pelicans announced. </p>\n<p>Poole has missed the previous 10 games due to a quad strain.</p>\n<p>The Pelicans also announced that Herb Jones will miss at least one week with a mild calf strain.</p>\n<p>The Pelicans are 1-9 without Poole, losing nine straight games. </p>",
    "link": "https://basketball.realgm.com/wiretap/282902/Jordan-Poole-Cleared-For-Basketball-Activities;-Herb-Jones-Out-At-Least-One-Week-With-Calf-Strain",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-25T03:06:54",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Poole_Jordan_nop_251025.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282902/Jordan-Poole-Cleared-For-Basketball-Activities;-Herb-Jones-Out-At-Least-One-Week-With-Calf-Strain"
  },
  {
    "title": "NBA PER (Week 5): James Harden Moves Into Top-10",
    "summary": "<p>James Harden has moved into the top-10 in the NBA in PER with a mark of 24.6. Harden scored a Los Angeles Clippers' franchise record 55 points last week. Nikola Jokic remains No. 1 ahead of Giannis Antetokounmpo and Shai Gilgeous-Alexander.</p>\n<p><span style=\"text-decoration: underline;\"><strong>NBA PER (Week 5):</strong></span><br />1. Nikola Jokic: 36.4<br />2. Giannis Antetokounmpo: 33.8<br />3. Shai Gilgeous-Alexander: 32.9<br />4. Luka Doncic: 28.2<br />5. Jalen Duren: 27.5<br />6. Victor Wembanyama: 25.3<br />7. Donovan Mitchell: 25.1<br />8. James Harden: 24.6<br />9. Tyrese Maxey: 24.0<br />10. Jimmy Butler: 24.0<br />11. Julius Randle: 23.6<br />12. Stephen Curry: 23.6<br />13. Joel Embiid: 23.2<br />14. Jalen Johnson: 22.8<br />15. Ausin Reaves: 22.6<br />16. Lauri Markkanen: 22.2<br />17. Jaylen Brown: 21.9<br />18. Kristaps Porzingis: 21.8<br />19. Jalen Brunson: 21.6<br />20. Alperen Sengun: 21.5</p>",
    "link": "https://basketball.realgm.com/wiretap/282901/NBA-PER-Week-5-James-Harden-Moves-Into-Top-10",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-24T15:11:38",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Harden_James_lac_241014.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282901/NBA-PER-Week-5-James-Harden-Moves-Into-Top-10"
  },
  {
    "title": "Chauncey Billups Pleads Not Guilty To Mafia-Backed Poker Scheme Charges",
    "summary": "<p>Portland Trail Blazers head coach Chauncey Billups pleaded not guilty Monday to federal charges alleging he profited from rigged poker games involving Mafia figures and at least one other former NBA player. The Hall of Famer faces money laundering conspiracy and wire fraud conspiracy charges, each carrying a maximum 20-year prison sentence.</p>\n<p>Billups was arraigned in federal court in New York City and released on $5 million bond. He used his Colorado home as collateral, with his daughter Cydney, manager of team and player services for the Minnesota Timberwolves, cosigning the bond.</p>\n<p>Prosecutors allege the 49-year-old five-time All-Star participated in a scheme that defrauded victims of approximately $7 million starting in 2019. The operation involved rigged poker games in Manhattan, Las Vegas, Miami and the Hamptons using sophisticated technology including altered card-shuffling machines, hidden cameras and X-ray equipment.</p>\n<p>Billups allegedly served as a celebrity \"face card\" to attract wealthy, unsuspecting players to the games. Prosecutors say he received portions of ill-gotten gains, including a $50,000 wire transfer after one rigged game in October 2020.</p>\n<p>Former NBA player and assistant coach Damon Jones was also charged in the alleged poker scheme. Jones faces additional charges alongside Miami Heat guard Terry Rozier in a separate scheme involving insider information about NBA players.</p>\n<p>The scheme organizers shared proceeds with the Gambino, Genovese and Bonanno crime families for operating within their territory, prosecutors said. Mafia members allegedly helped commit violent acts including assault, extortion and robbery to ensure debt repayment and operational success.</p>\n<p>Billups was placed on unpaid leave by the Trail Blazers, who named assistant coach Tiago Splitter as interim coach. The 2004 NBA Finals MVP earned approximately $106 million during his 17-year playing career.</p>\n<p>All 31 defendants are due back in court March 4, with trial scheduled to begin in September 2026.</p>",
    "link": "https://basketball.realgm.com/wiretap/282900/Chauncey-Billups-Pleads-Not-Guilty-To-Mafia-Backed-Poker-Scheme-Charges",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-24T15:05:27",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Billups_Chauncey_por_211227.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282900/Chauncey-Billups-Pleads-Not-Guilty-To-Mafia-Backed-Poker-Scheme-Charges"
  },
  {
    "title": "Dunc'd On: Full 15 in 60! (Western Conference 11.24.25)",
    "summary": "<p></p>\n<div class=\"episode-long-desc\">\n<p>Our bi-weekly look at the Western Conference!</p>\n<p>LAL @ UTA: The Lakers hold on against the Jazz in LeBron James' second game of the season.</p>\n<p>NOP @ DAL: Two young teams go at each other in a fun matchup over the weekend.</p>\n<p>POR: What makes Deni Avdija so hard to stop?</p>\n<p>MIN: Rob Dillingham just isn't a rotation player right now for a team with the Wolves' aspirations</p>\n<p>DEN: How could they use Cam Johnson more?</p>\n<p>HOU: How real is their 3-point shooting?</p>\n<p>PHX: Collin Gillespie has been a big part of the Suns' resurgence</p>\n<p>LAC: James Harden's 55-point game was a ton of fun to watch</p>\n<p>SAS: David Jones-Garcia looks like a solid stopgap with their guard injuries</p>\n<p>MEM: Jaylen Wells has struggled in his second year</p>\n<p>OKC: Their 31-4 run in 15 possessions against Utah</p>\n<p>GSW: Moses Moody is finally getting major minutes</p>\n<p>SAC: Getting Keegan Murray back will help them return to respectability</p>\n</div>\n<div class=\"episode-long-desc\">\n<p>Join Dunc'd On Prime! It's the only place to get every episode with Nate & Danny, plus every pod with John Hollinger & Nate as well!</p>\n<p><a href=\"https://www.youtube.com/c/NateDuncan\">Subscribe on YouTube</a> to see our hilarious faces and, more importantly, see watch this free pod twice a week.</p>\n<p>Or, sign up for our FREE mailing list to get <a href=\"https://supportingcast.us17.list-manage.com/subscribe?u=dccd41580f4391a31c00ca695&amp;id=52b46b92ee\">Dan Feldman's Daily Duncs</a> with all the major topics around the league twice a week.</p>\n</div>\n<p></p>",
    "link": "https://basketball.realgm.com/wiretap/282899/Duncd-On-Full-15-in-60!-Western-Conference-112425",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-24T14:50:32",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/James_LeBron_lal_240515.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282899/Duncd-On-Full-15-in-60!-Western-Conference-112425"
  },
  {
    "title": "Clippers Have Shown Interest In Trading For DeMar DeRozan",
    "summary": "<p>If the Sacramento Kings turn to trading veterans to start a rebuild, DeMar DeRozan could be one of the players they move. The LA Clippers have shown some interest in acquiring DeRozan, should he become available.</p>\n<p>DeRozan makes $24.75 million this season. Next season, the veteran wing is on the books for $25.74 million, but only $10 million of that deal is guaranteed. DeRozan could trigger additional guarantees if he's named a 2026 All-Star, or if the Kings win the 2026 NBA Finals, but neither of those seem likely.</p>\n<p>The Clippers have struggled out of the gate, with several of their veterans going down with injuries. Kawhi Leonard returned to the lineup on Sunday, while Bradley Beal was ruled out for the season due a fractured hip.</p>\n<p>The Kings have struggled to find the right mix. GM Scott Perry won't put a label on his team by saying they are rebuilding, but he's said it's going to take some time to get Sacramento into a better place.</p>",
    "link": "https://basketball.realgm.com/wiretap/282898/Clippers-Have-Shown-Interest-In-Trading-For-DeMar-DeRozan",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-24T09:40:57",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/DeRozan_DeMar_sac_241015.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282898/Clippers-Have-Shown-Interest-In-Trading-For-DeMar-DeRozan"
  },
  {
    "title": "Jalen Williams No Longer Eligible For Max Extension Bump",
    "summary": "<p>Oklahoma City Thunder wing Jalen Williams missed his 18th game of the season on Sunday. Williams is recovering from offseason surgery on his right wrist and is reportedly closing in on a return. However, missing an 18th game means that Williams is no longer eligible for regular season awards, such as All-NBA.</p>\n<p>Players must appear in at least 65 games to be eligible for most NBA regular season awards.</p>\n<p>That has an impact on the rookie scale extension that Williams signed with the Thunder this offseason. Had Williams made an All-NBA team, his extension would have climbed beyond the base of 25% of the 2026-27 salary cap. Williams could have earned up to 30% of the cap, had he been named to the All-NBA First Team.</p>\n<p>Now, Williams' extension will start at 25% of the cap. That projects to $41.5 million for next season. Williams and big man Chet Holmgren will have identical five-year extensions, which will pay both players a projected $240.7 million through the 2030-31 season.</p>",
    "link": "https://basketball.realgm.com/wiretap/282897/Jalen-Williams-No-Longer-Eligible-For-Max-Extension-Bump",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-24T09:29:44",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Williams_Jalen_okc_250531.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282897/Jalen-Williams-No-Longer-Eligible-For-Max-Extension-Bump"
  },
  {
    "title": "Al Horford Out At Least 1 Week With Sciatica",
    "summary": "<p>Golden State Warriors center Al Horford is set to miss one week due to sciatica, Steve Kerr announced on Sunday.</p>\n<p>Horford suffered the injury on Friday against the Blazers.</p>\n<p>Horford is scheduled to get an MRI in the future.</p>\n<p>The 39-year-old is averaging 5.8 points and 4.2 rebounds on the season. </p>",
    "link": "https://basketball.realgm.com/wiretap/282896/Al-Horford-Out-At-Least-1-Week-With-Sciatica",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-24T03:20:14",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Horford_Al_gsw_251026.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282896/Al-Horford-Out-At-Least-1-Week-With-Sciatica"
  },
  {
    "title": "Steve Kerr: 'No Idea' When Jonathan Kuminga Will Return From Knee Tendonitis",
    "summary": "<p>Jonathan Kuminga is set to miss his sixth straight game on Monday against the Utah Jazz due to knee tendonitis.</p>\n<p>Steve Kerr said following Sunday's practice that he has \"no idea\" when Kuminga will return to the court.</p>\n<p>Kuminga was initially thought to be \"day to day\" following the injury on November 12.</p>\n<p>\"He did a few things,\" Kerr said on Sunday. \"He's got to tell you where he is ... We didn't do scrimmages, but we did live-drill work, and he barely did any of that. So, not moving well. The training staff is working with him. I have no idea when he's going to play.\"</p>\n<p>It was reported earlier this week that there is growing expectation that <a href=\"https://basketball.realgm.com/wiretap/282858/Growing-Anticipation-Jonathan-Kuminga-Will-Get-Traded-By-Warriors\">Kuminga will be traded</a> this season. </p>",
    "link": "https://basketball.realgm.com/wiretap/282895/Steve-Kerr-No-Idea-When-Jonathan-Kuminga-Will-Return-From-Knee-Tendonitis",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-24T03:15:22",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Kuminga_Jonathan_gsw_241017.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282895/Steve-Kerr-No-Idea-When-Jonathan-Kuminga-Will-Return-From-Knee-Tendonitis"
  },
  {
    "title": "Deandre Ayton Leaves Lakers' Win With Knee Contusion",
    "summary": "<p>Deandre Ayton left the Los Angeles Lakers' 108-106 win over the Utah Jazz with a right knee contusion. </p>\n<p>Ayton suffered the injury in the second quarter after colliding with Ace Bailey.</p>\n<p>Jaxson Hayes started in Ayton's place in the second half. </p>\n<p>Ayton is averaging 16.5 points and 8.8 rebounds on the season. </p>",
    "link": "https://basketball.realgm.com/wiretap/282894/Deandre-Ayton-Leaves-Lakers-Win-With-Knee-Contusion",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-24T03:12:43",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Ayton_Deandre_lal_251025.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282894/Deandre-Ayton-Leaves-Lakers-Win-With-Knee-Contusion"
  },
  {
    "title": "Tyler Herro To Return From Ankle Surgery On Monday",
    "summary": "<p>Tyler Herro will make his regular season debut on Monday when the Miami Heat play the Dallas Mavericks. Herro has recovered from his September 19th ankle surgery.</p>\n<p>Herro dealt with an impingement in his left foot last season then suffered an ankle injury during an offseason workout.</p>\n<p>Miami has an 11-6 record to start the season with an improved and more dynamic offense.</p>",
    "link": "https://basketball.realgm.com/wiretap/282893/Tyler-Herro-To-Return-From-Ankle-Surgery-On-Monday",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-23T22:17:19",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Herro_Tyler_mia_220523.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282893/Tyler-Herro-To-Return-From-Ankle-Surgery-On-Monday"
  },
  {
    "title": "NBA Emerges As Most Investor-Friendly League Amid Record Team Sales",
    "summary": "<p>The NBA has distinguished itself as \"the most investor-friendly league in North American pro sports,\" according to forensic accounting expert Jesse Silvertown, as the basketball world witnesses an unprecedented wave of franchise transactions. Nearly 25 percent of NBA franchises have changed hands since 2020, with three teams in the Boston Celtics, Los Angeles Lakers, and Portland Trail Blazers announcing sales this year alone at a collective valuation exceeding $20 billion.</p>\n<p>Silvertown, principal at forensic accounting firm Hesperus, tells Front Office Sports the NBA's investor-friendly environment stems from a higher cap on private capital, limited labor strife, and a lucrative long-term media-rights deal. These factors have positioned the league ahead of the NFL and MLB in facilitating ownership transitions.</p>\n<p>The league's $77 billion media-rights deal with ESPN, NBC, and Amazon represents a 220% increase from the prior agreement. This financial windfall has driven franchise valuations to historic levels, creating optimal conditions for legacy owners to exit.</p>\n<p>\"My guess is that this is the start of a trend,\" Tripp Crews of business valuation firm Mercer Capital tells FOS. \"The combination of soaring valuations and private equity gaining access to this new class of assets should create more of these transactions in the future.\"</p>\n<p>The NBA formalized private equity investment pathways in January 2021, allowing single PE funds to hold up to 20% stakes in as many as five teams. Major firms like Sixth Street, Dyal HomeCourt Partners, and Arctos Partners now hold stakes across multiple franchises.</p>\n<p>Most recent sales have been driven by aging owners, estate planning, or scandals, Silvertown notes. The sellers this year include owners in their mid-60s, while new buyers like Marc Lore, Alex Rodriguez, and Tom Dundon range from 50 to 56 years old.</p>\n<p>The league has seen 23 change-of-control sales since 2010, a dramatic increase from the 1990s when such transactions were rare and significantly less expensive.</p>\n<p>\"Economically, the choices are to become a real estate company around a new or updated arena, bring in PE money-which many who have not sold are doing-or both,\" Mark Cuban tells FOS.</p>",
    "link": "https://basketball.realgm.com/wiretap/282892/NBA-Emerges-As-Most-Investor-Friendly-League-Amid-Record-Team-Sales",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-23T22:10:01",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_realgm.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282892/NBA-Emerges-As-Most-Investor-Friendly-League-Amid-Record-Team-Sales"
  },
  {
    "title": "Dallas Wings Win 2026 WNBA Draft Lottery",
    "summary": "<p>For the second year in a row, the Dallas Wings will have the No. 1 pick in the WNBA draft.</p>\n<p>The Wings, who took UConn's Paige Bueckers in 2025, won the 2026 WNBA draft lottery Sunday and will select first on April 13. They are the fourth franchise to have the first overall pick in consecutive seasons.</p>\n<p>Lottery odds were based on the cumulative records of the past two WNBA regular seasons for the five teams that did not make the playoffs in 2025. Two trades landed the Minnesota Lynx and Seattle Storm in the lottery.</p>",
    "link": "https://basketball.realgm.com/wiretap/282891/Dallas-Wings-Win-2026-WNBA-Draft-Lottery",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-23T21:01:54",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/wnba_dallaswings.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282891/Dallas-Wings-Win-2026-WNBA-Draft-Lottery"
  },
  {
    "title": "Kevin Durant To Miss Two Games For Family Issue",
    "summary": "<p>Houston Rockets star Kevin Durant will miss the next two games while tending to a family matter, sources told ESPN's Shams Charania on Sunday.</p>\n<p>Durant will miss road games against two of his former teams: the Phoenix Suns on Monday and Golden State Warriors on Wednesday.</p>",
    "link": "https://basketball.realgm.com/wiretap/282889/Kevin-Durant-To-Miss-Two-Games-For-Family-Issue",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-23T17:53:17",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Durant_Kevin_hou_251010.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282889/Kevin-Durant-To-Miss-Two-Games-For-Family-Issue"
  },
  {
    "title": "Kobe Bufkin, Grizzlies To Sign Hardship 10 Day Contract",
    "summary": "<p>The Memphis Grizzlies will sign point guard Kobe Bufkin to a hardship 10 Day contract. Memphis continues to have several players out with long-term injuries. This includes guards Ja Morant, Ty Jerome, Scotty Pippen Jr. and Javon Small.</p>\n<p>Bufkin was the 15th pick in the 2023 NBA Draft by the Atlanta Hawks. The Hawks traded Bufkin to the Brooklyn Nets this past offseason in a salary-clearing move. The Nets waived the point guard ahead of the regular season.</p>\n<p>This season, Bufkin has appeared in two G League games with the South Bay Lakers. The 6-foot-4 guard has averaged 22 points, 6.5 rebounds and four assists per game.</p>",
    "link": "https://basketball.realgm.com/wiretap/282888/Kobe-Bufkin-Grizzlies-To-Sign-Hardship-10-Day-Contract",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-23T13:26:19",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Bufkin_Kobe_atl_241230.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282888/Kobe-Bufkin-Grizzlies-To-Sign-Hardship-10-Day-Contract"
  },
  {
    "title": "Aaron Gordon To Miss 4-6 Weeks Due To Hamstring Strain",
    "summary": "<p>Denver Nuggets power forward Aaron Gordon will miss at least four-to-six weeks due to a Grade 2 right hamstring strain. Gordon was attempted to play in the Nuggets win over the Houston Rockets on Friday, but exited the game after just three minutes. Postgame, Denver coach David Adelman said that he expected to Gordon to miss time.</p>\n<p>Gordon is the second Nuggets starter to go down in recent weeks. Starting wing Christian Braun is out for six weeks after suffering a sprained left ankle a week-and-a-half ago.</p>\n<p>Gordon is averaging a career-high 18.8 point per game on 53/44/87 shooting splits. The absence of two starters means the Nuggets will rely more on Peyton Watson, while cobbling together the fifth starter. Two-Way player Spencer Jones drew the start in Denver's home loss to the Sacramento Kings on Saturday.</p>",
    "link": "https://basketball.realgm.com/wiretap/282887/Aaron-Gordon-To-Miss-4-6-Weeks-Due-To-Hamstring-Strain",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-23T11:58:26",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Gordon_Aaron_den_250513.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282887/Aaron-Gordon-To-Miss-4-6-Weeks-Due-To-Hamstring-Strain"
  },
  {
    "title": "Kings Receiving Trade Interest In Keon Ellis",
    "summary": "<p>The Sacramento Kings are starting to look at trading veteran players to start the rebuilding process. The player that Sacramento has received the most calls about is wing Keon Ellis. More than half of the NBA has reportedly expressed interest in trading for Ellis.</p>\n<p>The 6-foot-4 wing is in the final season of his contract at $2.3 million. That small salary makes Ellis easily acquirable for the rest of the NBA. Ellis is eligible for a contract extension on February 9. If remains with Sacramento, Ellis is eligible to sign a four-year extension for up to $87 million.</p>\n<p>The Kings believe the 25-year-old guard/forward is young enough to fit if they pivot towards a rebuild. But Sacramento could get offers of a first-round pick for Ellis. He is currently believed to have the most trade value of any player on the Kings roster.</p>",
    "link": "https://basketball.realgm.com/wiretap/282886/Kings-Receiving-Trade-Interest-In-Keon-Ellis",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-23T11:27:24",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_sacramentokings.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282886/Kings-Receiving-Trade-Interest-In-Keon-Ellis"
  },
  {
    "title": "Kings Open To Trading Veterans To Start Rebuild",
    "summary": "<p>The Sacramento Kings have signaled to the rest of the NBA that they are open to trading their veteran players ahead of the trade deadline. Kings GM Scott Perry reportedly has realized that Sacramento must undertake a multi-year rebuild vs chasing a playoff spot with his current group.</p>\n<p>Young building blocks Keegan Murray and Nique Clifford are both said to be off limits in trade talks. Veterans like Zach LaVine, DeMar DeRozan and Domantas Sabonis are expected to be available via trade.</p>\n<p>The challenge for Sacramento is that each of those veterans may not lead to a big return in a trade. LaVine would have more value if teams knew he was likely to opt out of his $48.9 million player option for next season. Sabonis is owed $94 million for the next two seasons after this one. DeRozan has one year left on his deal, and it's partially guaranteed at $10 million.</p>",
    "link": "https://basketball.realgm.com/wiretap/282885/Kings-Open-To-Trading-Veterans-To-Start-Rebuild",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-23T11:20:15",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/LaVine_Zach_sac_250206.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282885/Kings-Open-To-Trading-Veterans-To-Start-Rebuild"
  },
  {
    "title": "Landry Shamet Exits Knicks Loss Early With Shoulder Injury",
    "summary": "<p>New York Knicks guard Landry Shamet exited his team's loss early on Saturday night due to a right shoulder injury. Shamet was injured in the first quarter of the Knicks road loss at the Orlando Magic. The veteran guard appeared to have suffered a dislocated right shoulder after running into a screen set by Orlando center Wendell Carter Jr.</p>\n<p>Last season, Shamet suffered a dislocated right shoulder in the preseason. New York waived the guard, as he was going to miss significant time. Shamet spent roughly two months rehabbing the injury before signing with the Knicks in late-December.</p>\n<p>Shamet had been starting for New York, with OG Anunoby sidelined due to a hamstring injury. The shooting guard was averaging 9.3 points and shooting 42.4% from behind the arc.</p>\n<p>If Shamet elects to undergo surgery this time, or is set to miss significant time, New York could choose to waive him. Shamet is playing on a non-guaranteed contract. The Knicks have just over $148,000 in space under their second-apron hard cap. New York could free up some needed flexibility, as they can't add another player until April as things currently stand.</p>",
    "link": "https://basketball.realgm.com/wiretap/282884/Landry-Shamet-Exits-Knicks-Loss-Early-With-Shoulder-Injury",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-23T09:54:47",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Shamet_Landry_nyk_241011.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282884/Landry-Shamet-Exits-Knicks-Loss-Early-With-Shoulder-Injury"
  },
  {
    "title": "Ty Jerome Out 6-9 More Weeks With Calf Strain",
    "summary": "<p>The Memphis Grizzlies announced that guard Ty Jerome would miss six to nine more weeks as he recovers from his high-grade right calf strain. The Grizzlies said Jerome is recovering well from the injury.</p>\n<p>Jerome hasn't appeared in a regular season game for Memphis after being injured during the preseason. The Grizzlies signed the veteran combo guard to a three-year, $27.6 million deal this offseason.</p>",
    "link": "https://basketball.realgm.com/wiretap/282883/Ty-Jerome-Out-6-9-More-Weeks-With-Calf-Strain",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-23T09:11:45",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Jerome_Ty_mem_251023.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282883/Ty-Jerome-Out-6-9-More-Weeks-With-Calf-Strain"
  },
  {
    "title": "Jamahl Mosley Exits Magic Game Early Due To Illness",
    "summary": "<p>Orlando Magic head coach Jamahl Mosley missed the second half of his team's victory on Saturday due to illness. Assistant coach Joe Prunty finished the win over the Knicks in Mosley's place.</p>\n<p>Postgame, Mosley said he was feeling much better after the \"scary\" situation. Mosley said he was lightheaded and dizzy, while adding that he was unable to even watch the second half of the game. The Magic coach said he believes that he'll be ok to coach the team's game on Sunday in Boston.</p>",
    "link": "https://basketball.realgm.com/wiretap/282882/Jamahl-Mosley-Exits-Magic-Game-Early-Due-To-Illness",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-22T21:14:35",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Mosley_Jamahl_orl_231205.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282882/Jamahl-Mosley-Exits-Magic-Game-Early-Due-To-Illness"
  },
  {
    "title": "Bruce Branch III Reclassifies To Class Of 2026",
    "summary": "<p>The No. 2-ranked prospect in the high school class of 2027, Bruce Branch III, has reclassified and will graduate in 2026. That will put Branch in college a year earlier than expected.</p>\n<p>\"I believe in my ability. I am confident that I can do this,\" Branch told ESPN. \"I have been playing up my whole life. I am not going to let anyone outwork me. I remember when I was in the first grade playing against third graders. I got pushed down, and I got back up.\"</p>\n<p>Branch has yet to decide on his college choice. All of the traditional college basketball blue bloods are involved. For his part, the 6-foot-5 forward is staying focused on his final season in high school at Prolific Prep in Florida.</p>\n<p>\"I want to take things one step at a time,\" Branch said. \"I want to focus on our season and my team. I want to win it all at Chipotle [Nationals].\"</p>",
    "link": "https://basketball.realgm.com/wiretap/282881/Bruce-Branch-III-Reclassifies-To-Class-Of-2026",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-22T21:07:23",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/ncaa_logo.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282881/Bruce-Branch-III-Reclassifies-To-Class-Of-2026"
  },
  {
    "title": "DeMar DeRozan, Zach LaVine Spoke About Frustrations With Kings Season",
    "summary": "<p>After the Sacramento Kings were blown out by the Memphis Grizzlies on Thursday, DeMar DeRozan and Zach LaVine spoke about the challenges the team is going through this season. Both DeRozan and LaVine talked about the issues they have as individuals and the frustrations the team has as a whole.</p>\n<p>When asked where the Kings are emotionally, DeRozan was blunt.</p>\n<p>\"In a s-ty place,\" DeRozan said. \"Don't nobody want to lose the way we've been losing. I think it's just everything right now for us is just s-ty, honestly. Sometimes when you're in the deep end, it's hard to hear anything. You're just trying to swim your way out, one way or another.\"</p>\n<p>DeRozan also expressed some uncertainty with his future in Sacramento.</p>\n<p>\"I'm pretty sure everything comes into question when you're in the situation like we're in now,\" DeRozan said. \"That's another thing that's frustrating. That's another thing. Only time will tell. We'll see.\"</p>\n<p>LaVine said he can't have the impact he's supposed to have if he's not able to play more aggressively.</p>\n<p>\"I'm not my best self when I take eight to 10 shots,\" LaVine said about his recent play. \"I can be as efficient as you want me to be. But if I'm taking eight shots, it's like, what are we doing? So today I just tried to be a little more aggressive, try to find spots, my teammates (were trying) to find me, which was great.</p>\n<p>\"But obviously it didn't result in anything like a win. I'd love to go 4-for-8 and we win. I scored a lot of points in my career. We're just trying to get a win right now. Gotta go sit on this flight. Got a day tomorrow. Got a game Saturday. Come Saturday, gotta figure it out.</p>\n<p>\"Only time will tell. It's hard to say right now. A lot of frustrations from a lot of angles. Still a lot of season left, still a lot that's in front of us. We gotta fight for something.\"</p>\n<p>LaVine said part of his frustration comes from not being on the floor late in some recent games.</p>\n<p>\"I'll always be a team guy,\" LaVine said. \"(But) personally, I don't like it. I've never not played in the fourth. But when you're trying to find a win, you do whatever you can, I guess.\"</p>",
    "link": "https://basketball.realgm.com/wiretap/282880/DeMar-DeRozan-Zach-LaVine-Spoke-About-Frustrations-With-Kings-Season",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-22T12:14:40",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/DeRozan_DeMar_sac_241015.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282880/DeMar-DeRozan-Zach-LaVine-Spoke-About-Frustrations-With-Kings-Season"
  },
  {
    "title": "Zach Lowe To Join Amazon Prime NBA Coverage",
    "summary": "<p>NBA analyst Zach Lowe will join Amazon Prime's NBA coverage this season. Lowe will start on Black Friday, and will make appearances throughout the season on Prime's studio shows.</p>\n<p>Lowe spent several years writing and podcasting for ESPN, before making regular appearances on ESPN NBA programs. Lowe is currently podcasting multiple times per week for The Ringer, which hosts The Zach Lowe Show.</p>",
    "link": "https://basketball.realgm.com/wiretap/282879/Zach-Lowe-To-Join-Amazon-Prime-NBA-Coverage",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-22T12:02:27",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_prime.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282879/Zach-Lowe-To-Join-Amazon-Prime-NBA-Coverage"
  },
  {
    "title": "Kawhi Leonard To Return On Sunday At Cavaliers",
    "summary": "<p>LA Clippers forward Kawhi Leonard plans to return to the lineup on Sunday at the Cleveland Cavaliers. Leonard has missed the Clippers last nine games with a sprained ankle and foot injury.</p>\n<p>LA is looking to snap a three-game losing streak on Saturday afternoon at the Charlotte Hornets. LA is 4-11 overall and has gone 1-8 without Leonard in the lineup this season.</p>\n<p>Leonard's season was off to a strong start before suffering the ankle and foot injury. The veteran forward averaged 24.3 points, 5.7 rebounds, 3.5 assists and 2.5 steals while playing in the Clippers first six games.</p>",
    "link": "https://basketball.realgm.com/wiretap/282878/Kawhi-Leonard-To-Return-On-Sunday-At-Cavaliers",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-22T11:51:00",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Leonard_Kawhi_lac_250423.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282878/Kawhi-Leonard-To-Return-On-Sunday-At-Cavaliers"
  },
  {
    "title": "Chris Paul Announces He'll Retire Following This Season",
    "summary": "<p>Veteran NBA guard Chris Paul announced that he'll retire following this season. Paul is currently playing his 21st NBA season with the LA Clippers.</p>\n<p>Paul played the first six years of his career with the New Orleans/Oklahoma City Hornets. He was traded to the LA Clippers ahead of the 2011-12 season, where Paul would spend the next six seasons.</p>\n<p>Paul was then traded to the Houston Rockets, where he played for two seasons. That was followed by one season with the Oklahoma City Thunder, before being traded to the Phoenix Suns for three years. Paul then spent a season each with the Golden State Warriors and San Antonio Spurs, before returning to the Clippers for what will now be his final season.</p>\n<p>The veteran point guard posted \"Back in NC!!! What a ride...Still so much left...GRATEFUL for this last one!!\" on social media ahead of the Clippers game on Saturday at the Charlotte Hornets. Paul is a native of North Carolina and played for two seasons at Wake Forest before being the fourth overall pick in the 2005 NBA Draft.</p>",
    "link": "https://basketball.realgm.com/wiretap/282877/Chris-Paul-Announces-Hell-Retire-Following-This-Season",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-22T11:44:57",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Paul_Chris_lac_251104.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282877/Chris-Paul-Announces-Hell-Retire-Following-This-Season"
  },
  {
    "title": "Dunc'd On: LATE Night NBA Cup Friday",
    "summary": "<p></p>\n<div class=\"episode-long-desc\">\n<p>Denver and Houston was a fascinating tactical matchup between two of the three-best teams in the league with a lot of different pitches to throw.</p>\n<p>Phoenix's new identity helped them steal a game they had no business winning against the Wolves. 33:43</p>\n<p>Portland took control of their own destiny in the West Group of Death with an upset over Golden State. 46:24</p>\n<p>We look at the rest of the NBA Cup standings and scenarios, then discuss the latest news including LaMelo Ball and Anthony Davis potentially being on the block. 1:02:24</p>\n</div>\n<div class=\"episode-long-desc\">\n<p>Join Dunc'd On Prime! It's the only place to get every episode with Nate & Danny, plus every pod with John Hollinger & Nate as well!</p>\n<p><a href=\"https://www.youtube.com/c/NateDuncan\">Subscribe on YouTube</a> to see our hilarious faces and, more importantly, see watch this free pod twice a week.</p>\n<p>Or, sign up for our FREE mailing list to get <a href=\"https://supportingcast.us17.list-manage.com/subscribe?u=dccd41580f4391a31c00ca695&amp;id=52b46b92ee\">Dan Feldman's Daily Duncs</a> with all the major topics around the league twice a week.</p>\n</div>\n<p></p>",
    "link": "https://basketball.realgm.com/wiretap/282876/Duncd-On-LATE-Night-NBA-Cup-Friday",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-22T11:33:24",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Jokic_Nikola_den_250131.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282876/Duncd-On-LATE-Night-NBA-Cup-Friday"
  },
  {
    "title": "Heat Seeking Clarity On Ability To Trade Terry Rozier",
    "summary": "<p>Terry Rozier III remains away from the Miami Heat on leave. Rozier is being investigated for alleged involvement in gambling and fixing stats in games. The Heat have moved on without Rozier on the floor, but the team is still looking for clarity from the NBA as to the ability to trade the veteran guard.</p>\n<p>Miami has not received guidance from the NBA as to their ability to put Rozier in a trade. Or more accurately put: to use Rozier's expiring $26.6 million contract as salary matching in a deal.</p>\n<p>When contacted by the South Florida Sun Sentinel, the NBA declined to say that the Heat are prohibited from including Rozier in any trades, but the team has not been given the go-ahead to do so either.</p>\n<p>The Heat have gotten off to a 10-6 start this season, despite injuries to several key players. If Miami feels they are ready to make a playoff run, Rozier's expiring deal could be an important piece of salary-matching in potential trades.</p>",
    "link": "https://basketball.realgm.com/wiretap/282875/Heat-Seeking-Clarity-On-Ability-To-Trade-Terry-Rozier",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-22T10:24:59",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Rozier_Terry_mia_240226.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282875/Heat-Seeking-Clarity-On-Ability-To-Trade-Terry-Rozier"
  },
  {
    "title": "Aaron Gordon May Miss Time Due To Hamstring Injury",
    "summary": "<p>The Denver Nuggets pulled out a good road win over the Houston Rockets on Friday. Unfortunately, the Nuggets lost Aaron Gordon during the process. Gordon exited the game in the game early due to hamstring soreness.</p>\n<p>The injury is believed to be similar to the one Gordon played through in last season's playoffs. With Denver's goal to make a Finals run, the Nuggets will prioritize their starting power forward's health over regular season success.</p>\n<p>\"We'll sit down again after tonight, with the discomfort that he had,\" Nuggets coach David Adelman said. \"We'll find out what the severity is. ... Aaron is a strong personality that knows what his body feels like, and so part of that conversation is his, too. The medical, the team, Aaron, and what's right for him. Obviously, the goal is to get him to the end of the year, if we're lucky enough to be in there. That's the most important thing to me, and obviously Aaron's long-term health as a player. Love the guy to death. So yeah, we'll make the best decision for him, with his counsel as well.\"</p>",
    "link": "https://basketball.realgm.com/wiretap/282874/Aaron-Gordon-May-Miss-Time-Due-To-Hamstring-Injury",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-22T10:15:05",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Gordon_Aaron_den_230109.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282874/Aaron-Gordon-May-Miss-Time-Due-To-Hamstring-Injury"
  },
  {
    "title": "Hornets Appear Willing To Listen To LaMelo Ball Trade Offers",
    "summary": "<p>While LaMelo Ball and the Charlotte Hornets have each given clear signals that they'd prefer to make the situation work and avoid a trade, the topic will likely remain one that the league tracks closely leading up to the 2026 NBA trade deadline. </p>\n<p>When asked to respond to the initial report, <a href=\"https://basketball.realgm.com/wiretap/282869/LaMelo-Ball-On-Trade-Rumors-I-Love-Being-Here\">Ball said he loves being with the Hornets and hopes to remain with the franchise</a>.</p>\n<p>\"The Hornets have definitely given other teams the impression they will listen to offers for him,\" wrote Jake Fischer during his Friday chat.</p>\n<p>Ball is averaging 21.6 points, 6.9 rebounds and 9.6 assists in 31.4 minutes over nine games this season. Ball, who is represented by <a href=\"https://basketball.realgm.com/info/agent_clients/Sam-Permut/855\">Sam Permut</a>, has $130 million remaining over the next three seasons on his contract.</p>",
    "link": "https://basketball.realgm.com/wiretap/282873/Hornets-Appear-Willing-To-Listen-To-LaMelo-Ball-Trade-Offers",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-22T08:06:36",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Ball_Lamelo_cha_201215.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282873/Hornets-Appear-Willing-To-Listen-To-LaMelo-Ball-Trade-Offers"
  },
  {
    "title": "Jaylen Brown Rips Celtics' Effort After 113-105 Loss To Nets",
    "summary": "<p>bJaylen Brown criticized his Boston Celtics teammates following a 113-105 loss to the Brooklyn Nets on Friday, saying the team lacked energy and effort in NBA Cup play. The defeat dropped Boston back to 8-8 after winning three straight games to reach .500 for the first time this season.</p>\n<p>\"Come ready to play, or don't play at all,\" Brown said. \"That's my whole thing. We've gotta come ready to play. We just went through the motions today. Like, I don't understand it.\"</p>\n<p>The Celtics trailed 62-53 at halftime after surrendering 40 second-quarter points to Brooklyn. Boston pulled within 96-94 midway through the fourth quarter but could not complete the comeback. The Nets improved to 3-12 with the victory.</p>\n<p>After tying the score at 51 with 3:23 left in the second quarter, the Celtics allowed an 11-2 run to close the half. A Josh Minott turnover with seven seconds remaining led to Brooklyn's final four points before halftime.</p>\n<p>Brown said his team didn't have the right effort \"for the majority of the game.\" He specifically pointed to late in the first half and the end of the third quarter as problematic stretches.</p>\n<p>\"Regardless if you're making or missing shots, regardless of anything, we've just got to come out and play with great energy, great enthusiasm for the game,\" Brown said. \"Like, want to win. It just didn't seem like that was the case tonight.\"</p>\n<p>Brooklyn's Michael Porter Jr. scored 33 points on 13-for-21 shooting. Nic Claxton recorded a triple-double with 18 points, 12 assists and 11 rebounds against Boston's defense.</p>\n<p>Joe Mazzulla acknowledged his team's margin for error is smaller this season without last year's talent and experience mix.</p>\n<p>\"I think it's true of any basketball team, but I think the margin for error is smaller for certain teams,\" Mazzulla said. \"And the margin for error is smaller for us. We have to be the best. We have to be sharp physically and mentally every night.\"</p>\n<p>Brown emphasized the need for his team to play with greater intensity moving forward.</p>\n<p>\"We need to play with an edge defensively and offensively,\" Brown said. \"Like, we've got to be the harder-playing team. That can't be negotiable. And tonight we weren't. Brooklyn was the harder-playing team. They played with more edge, and they deserved to win tonight.\"</p>\n<p><a href=\"https://basketball.realgm.com/player/Jaylen-Brown/Summary/52544\">Brown has a career high PER of 21.4 this season</a> as his usage has spiked to 35.6 without Jayson Tatum beside him in the lineup. Brown has also improved his efficiency with a True Shooting Percentage of .589 as his usage has scaled.</p>",
    "link": "https://basketball.realgm.com/wiretap/282872/Jaylen-Brown-Rips-Celtics-Effort-After-113-105-Loss-To-Nets",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-22T07:46:30",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Brown_Jaylen_bos_250504.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282872/Jaylen-Brown-Rips-Celtics-Effort-After-113-105-Loss-To-Nets"
  },
  {
    "title": "Scoot Henderson To Be Re-Evaluated In 2-4 Weeks; Jrue Holiday To Be Re-Evaluated In 1-2 Weeks",
    "summary": "<p>Scoot Henderson will be re-evaluated in 2-4 weeks as he recovers from a left hamstring injury, according to the Portland Trail Blazers. </p>\n<p>Henderson admitted that he still has <a href=\"https://basketball.realgm.com/wiretap/282836/Scott-Henderson-Return-To-Basketball-Activity-Remains-Week-To-Week\">difficulty with movement</a> as he rehabs the injury. </p>\n<p>Jrue Holiday will also be re-evaluated in 1-2 weeks with a right calf strain.</p>\n<p>The Blazers are 7-9 on the season.</p>",
    "link": "https://basketball.realgm.com/wiretap/282871/Scoot-Henderson-To-Be-Re-Evaluated-In-2-4-Weeks;-Jrue-Holiday-To-Be-Re-Evaluated-In-1-2-Weeks",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-22T02:01:46",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Henderson_Scoot_por_231028.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282871/Scoot-Henderson-To-Be-Re-Evaluated-In-2-4-Weeks;-Jrue-Holiday-To-Be-Re-Evaluated-In-1-2-Weeks"
  },
  {
    "title": "Jalen Johnson Credits LeBron James Workouts For Breakout Season",
    "summary": "<p>Atlanta Hawks forward Jalen Johnson is averaging 22 points, 9.5 rebounds and 6.5 assists in his fifth NBA season, emerging as a potential All-Star after a career marked by setbacks. Johnson told Andscape that his breakthrough came from embracing the process and working with Lakers star LeBron James last offseason.</p>\n<p>The 23-year-old was selected 20th overall by Atlanta in 2021 after leaving Duke mid-season. He played 12 games in the G League as a rookie and averaged just 2.2 points in 22 NBA games his first season.</p>\n<p>\"I didn't understand how to look at it from a bigger picture point of view,\" Johnson said of his time in the G League. \"So, for me, being 18, 19 in the G League, all your friends see you get drafted first round and they are expecting you to play [in the NBA]. So, I let a lot of outside noises kind of distract me from what's really important. So those first couple games, I was just kind of down there just to be down there.</p>\n<p>\"I think it was a couple weeks later and a switch just happened - 'I needed to embrace this. This is my time to get minutes, get more reps underneath me.' Considering I left school early and all that, it was good for me just embracing that whole process, the good and the bad of it. I had to check myself. It was kind of like a reality check. 'You're not who you think you are yet, so you got to go down here, you got to put in the work and you got to do your time down here, and when your time number gets called you're going to be ready.'\"</p>\n<p>Johnson's career turned around when Quin Snyder became Hawks head coach on Feb. 26, 2023. Snyder instilled confidence and freedom while coaching him \"pretty hard,\" leading to a breakthrough 2023-24 season averaging 16 points, 8.7 rebounds and 3.6 assists in 56 games.</p>\n<p>Johnson averaged 18.9 points and 10 rebounds through 33 games last season before a torn labrum required season-ending surgery. The Hawks finished 40-42 and were eliminated in the play-in tournament without him.</p>\n<p>\"I was in a tough spot, but those 36 games gave me the confidence that I would be right where I left off,\" Johnson said. \"It was hard leaving my team and the momentum we were building that season, especially coming off the [NBA Cup].\"</p>\n<p>Johnson worked out with James in Los Angeles during the offseason to improve his game.</p>\n<p>\"My time in the gym with him, I just enjoyed any knowledge he gave me,\" Johnson said of James. \"He just gave me little pointers. His work ethic, how he prepares, how he shows up before the workout and all that other stuff. I was really taking those small little pointers from him and just trying to implement it in my own routine. I was really just watching, man, just seeing how he moves and all that. It was great to have him around. I was blessed to be able to work with him.\"</p>\n<p>Johnson was named Eastern Conference Player of the Week for Nov. 10-16 after averaging 24 points, 12 rebounds, 9.3 assists and 2.5 steals as Atlanta went 4-0. He has led the Hawks since guard Trae Young was sidelined Oct. 29 with a sprained MCL.</p>\n<p>Atlanta awarded Johnson a five-year, $150 million contract extension in October 2024.</p>\n<p>\"Hard work really does pay off, and I'm a firm believer in that,\" Johnson said. \"One thing I learned about the NBA is not everybody wants to work. You get the money and you get the nice things and all that other stuff, but the work is what really separates the ones that want to be something in this league.\"</p>",
    "link": "https://basketball.realgm.com/wiretap/282870/Jalen-Johnson-Credits-LeBron-James-Workouts-For-Breakout-Season",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-22T01:58:19",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Johnson_Jalen_atl_230109.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282870/Jalen-Johnson-Credits-LeBron-James-Workouts-For-Breakout-Season"
  },
  {
    "title": "LaMelo Ball On Trade Rumors: I Love Being Here",
    "summary": "<p>LaMelo Ball reiterated his preference to remain with the Charlotte Hornets after practice on Friday following <a href=\"https://basketball.realgm.com/wiretap/282852/Report-LaMelo-Ball-Hornets-Open-To-Trade-Possibility\">a report that he is open to a trade away from the franchise that drafted him in 2020</a>.</p>\n<p>\"I love being here,\" Ball said . \"I ain't saying nothing. I'm just trying to win, that's it. That's what we're going to keep doing.\"</p>\n<p>The Hornets have a 4-11 record this season. In his first five seasons, Ball played in only 231 of 410 games due mostly to ankle issues.</p>\n<p>\"He never heard that come from me, so the source is not from me,\" Ball said. \"So it's just false info.\"</p>\n<p>Ball said he doesn't like commenting on rumors but felt he had to speak out before the reports got out of hand.</p>\n<p>\"When they get too big, you know, you gotta say something,\" Ball said. \"It was so much that it was making headlines in Bleacher Report and this and that, so I didn't want it to keep going on.\"</p>",
    "link": "https://basketball.realgm.com/wiretap/282869/LaMelo-Ball-On-Trade-Rumors-I-Love-Being-Here",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-21T15:55:10",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Ball_Lamelo_cha_201215.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282869/LaMelo-Ball-On-Trade-Rumors-I-Love-Being-Here"
  },
  {
    "title": "Darryn Peterson Ruled Out Next Three Games With Hamstring Injury",
    "summary": "<p>Darryn Peterson has been ruled out of the Players Era Festival in Las Vegas next week due to a hamstring strain. Peterson will miss all three games Kansas is scheduled to play.</p>\n<p>\"We're not going to have Darryn in Vegas,\" Self told reporters. \"Although, we have reevaluated, and he's right there close. But he hasn't quite done enough to put him in position to go out and play multiple games in a short span like that. So we're hopeful he's running and cutting and doing all those things while we're in Vegas, but not to the point where he's probably ready to play.\"</p>\n<p>Peterson last played on November 7th in a loss to North Carolina. Peterson is averaging 21.5 points, 3.5 rebounds and 3.0 assists in his first two games. </p>\n<p>Peterson is currently <a href=\"https://basketball.realgm.com/wiretap/282817/Darryn-Peterson-Projected-No-1-Overall-In-ESPNs-First-2026-NBA-Mock-Draft\">the projected No. 1 pick in ESPN's 2026 NBA mock draft</a> in what is a crowded class alongside AJ Dybantsa and Cameron Boozer.</p>",
    "link": "https://basketball.realgm.com/wiretap/282868/Darryn-Peterson-Ruled-Out-Next-Three-Games-With-Hamstring-Injury",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-21T15:40:51",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Peterson_Darryn_ku_251105.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282868/Darryn-Peterson-Ruled-Out-Next-Three-Games-With-Hamstring-Injury"
  },
  {
    "title": "Anthony Davis Trade Return For Mavericks Likely Similar To Kevin Durant Deal",
    "summary": "<p>The Dallas Mavericks are expected to explore trading Anthony Davis before February's trade deadline, according to rival teams around the league. Any potential return would likely resemble the Kevin Durant trade to the Houston Rockets rather than the hauls Utah Jazz received for Rudy Gobert and Donovan Mitchell in 2022. </p>\n<p>A Western Conference scout said <a href=\"https://basketball.realgm.com/nba/draft/future_drafts/detailed\">the depleted draft pick market around the league</a> limits Dallas's return options. <a href=\"https://basketball.realgm.com/nba/draft/future_drafts/tradeable\">Teams lack the assets to offer multiple first-round selections</a>. The Mavericks should expect a couple of solid players and a draft pick in any deal.</p>\n<p>Davis has $121.2 million remaining after this season, with salaries of $58.4 million and $62.7 million over the next two years. He becomes extension eligible this coming offseason. The 32-year-old center could sign an extension worth up to three seasons and $218.5 million beginning August 6, 2026.</p>\n<p>Several league sources struggled to identify a deep list of potential suitors for Davis. His massive salary presents significant obstacles for teams operating near luxury tax thresholds. Dallas is already pushing against the second apron and likely wants to avoid adding long-term maximum salary commitments.</p>\n<p>Davis is in the first year of a three-year, $175 million extension he signed with the Lakers in August 2023. His injury history raises concerns about long-term value despite his elite production when healthy. He holds a player option worth $62.8 million for the 2027-28 season.</p>\n<p>The Mavericks face difficult decisions regarding their roster construction and salary cap flexibility. Moving Davis would provide significant financial relief while potentially addressing long-term team building concerns.</p>",
    "link": "https://basketball.realgm.com/wiretap/282867/Anthony-Davis-Trade-Return-For-Mavericks-Likely-Similar-To-Kevin-Durant-Deal",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-21T15:15:25",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Davis_Anthony_dal_250208.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282867/Anthony-Davis-Trade-Return-For-Mavericks-Likely-Similar-To-Kevin-Durant-Deal"
  },
  {
    "title": "Warriors' Chris DeMarco Hired As Head Coach Of New York Liberty",
    "summary": "<p>Chris DeMarco has been hired by the WNBA's New York Liberty as tie new head coach. DeMarco first joined the Warriors in 2012 before Steve Kerr was hired in 2014.</p>\n<p>The Liberty parted ways with Sandy Brondello this offseason. New York won the WNBA championship in 2024 and have <a href=\"https://basketball.realgm.com/wnba/teams/New-York-Liberty/14/Stats\">a core of Breanna Stewart, Sabrina Ionescu, Natasha Cloud and Jonquel Jones</a>.</p>\n<p>DeMarco was elevated to a front of the bench role this season and is key in the Warriors' defensive game planning.</p>",
    "link": "https://basketball.realgm.com/wiretap/282866/Warriors-Chris-DeMarco-Hired-As-Head-Coach-Of-New-York-Liberty",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-21T13:58:02",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/wnba_newyorkliberty.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282866/Warriors-Chris-DeMarco-Hired-As-Head-Coach-Of-New-York-Liberty"
  },
  {
    "title": "Lakers Bring In Dodgers' Farhan Zaidi, Andrew Friedman As Advisors Under Mark Walter",
    "summary": "<p>Farhan Zaidi and Andrew Friedman, two key Los Angeles Dodgers executives, have taken on advisory roles with the Los Angeles Lakers as part of the ownership transition to Mark Walter, multiple sources told ESPN. Zaidi is functioning as Walter's representative during the transition while Friedman consults primarily with Lakers president Rob Pelinka.</p>\n<p>Zaidi currently serves as a special adviser to the Dodgers and is renowned for his analytics background. Sources close to the situation said he is helping oversee the transition process on Walter's behalf. Zaidi has also been consulting with the Los Angeles Sparks, the WNBA team owned by Walter and TWG Sports.</p>\n<p>Friedman, the Dodgers' president of baseball operations, has played a lesser role in the Lakers transition. He has helped the Dodgers win three of the past six World Series. His involvement focuses on consulting with Pelinka on basketball operations matters.</p>\n<p>Both the Lakers and Dodgers are expected to become part of TWG Sports, the entity Walter created to oversee his sports holdings. Zaidi and Friedman are acting as senior executives of TWG Sports following the Lakers sale closure last month. Walter was approved as the new majority owner on October 29 in a deal valued at $10 billion.</p>\n<p>The Lakers terminated several members of their scouting department on Thursday, including Joey and Jesse Buss. The brothers confirmed the dismissals to ESPN's Shams Charania. The moves represent the first significant personnel changes under Walter's ownership.</p>\n<p>As part of the ownership deal, Jeanie Buss will remain as the team's governor for at least the next five years. The arrangement allows for continuity while Walter assumes control of basketball operations decisions. The integration of Dodgers executives signals a data-driven approach to the Lakers' future direction.</p>",
    "link": "https://basketball.realgm.com/wiretap/282865/Lakers-Bring-In-Dodgers-Farhan-Zaidi-Andrew-Friedman-As-Advisors-Under-Mark-Walter",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-21T13:53:17",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Walter_Mark_lal_250619.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282865/Lakers-Bring-In-Dodgers-Farhan-Zaidi-Andrew-Friedman-As-Advisors-Under-Mark-Walter"
  },
  {
    "title": "Jazz 'Raving' About Ace Bailey, Feel 'Lucky' He Dropped To No. 5",
    "summary": "<p>Ace Bailey was a candidate to be picked as high as No. 2 in the 2025 NBA draft, but fell to the Utah Jazz at No. 5 and the team is ecstatic with his development since joining their program. Bailey reportedly didn't want to be drafted by the Jazz as his previous representation tried to get him to the Washington Wizards.</p>\n<p>\"I spent some time with the Jazz folks this week in L.A.,\" said Brian Windhorst. \"They were raving about Ace Bailey. Up and down. They love his make up. They raved about his basketball intelligence. They said he's just now beginning to work on his body. They haven't really done much of that. They are convinced that they were so lucky to get him at five.</p>\n<p>\"They tanked last year and then had egg all over his face when they had a horrible lottery night. They were so pleased he fell. They consider themselves lucky.\"</p>\n<p>Bailey is averaging 8.7 points, 3.4 rebounds and 1.5 assists in 20.3 minutes over 14 games as a rookie with the Jazz. </p>\n<p>Bailey was drafted after Cooper Flagg, Dylan Harper, VJ Edgecombe and Kon Knueppel. </p>",
    "link": "https://basketball.realgm.com/wiretap/282864/Jazz-Raving-About-Ace-Bailey-Feel-Lucky-He-Dropped-To-No-5",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-21T13:50:49",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Bailey_Ace_uta_251025.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282864/Jazz-Raving-About-Ace-Bailey-Feel-Lucky-He-Dropped-To-No-5"
  },
  {
    "title": "Grizzlies Expected To Explore Ja Morant's Trade Market",
    "summary": "<p>The Memphis Grizzlies are expected to eventually explore the trade market for Ja Morant ahead of the trade deadline, sources tell ESPN's Tim Bontemps. Morant's status with the Grizzlies long-term is unclear after the sides didn't hold any extension talks in the offseason and he was suspended one game early this season for conduct detrimental to the team.</p>\n<p>\"I do think they'll move him,\" a West scout said.</p>\n<p>Morant is currently out with a calf strain after averaging 17.9 points, 3.5 rebounds and 7.6 assists in 28.8 minutes over 12 games.</p>\n<p>Morant is currently signed through the 2027-28 season on five-year, $197 million contract. <a href=\"https://basketball.realgm.com/wiretap/282049/Ja-Morant-Plans-To-Negotiate-Next-NBA-Contract-Without-Agent\">Morant parted ways with Mike Miller as his agent earlier this season and doesn't have traditional representation currently</a>, which could complicate his trade talks. </p>\n<p>Morant could join LaMelo Ball and Trae Young as a trio of All-Star caliber point guards on the trade market this season.</p>",
    "link": "https://basketball.realgm.com/wiretap/282863/Grizzlies-Expected-To-Explore-Ja-Morants-Trade-Market",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-21T12:16:03",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Morant_Ja_mem_250421.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282863/Grizzlies-Expected-To-Explore-Ja-Morants-Trade-Market"
  },
  {
    "title": "WNBA Players Seek Revenue-Based System, View $1.1M Max Salary Proposal As Insufficient",
    "summary": "<p>The Women's National Basketball Players Association does not view the WNBA's latest collective bargaining agreement proposal as advancing negotiations, sources told ESPN on Thursday. The current CBA is set to expire November 30, just 10 days away. Players want a revenue-based salary system rather than fixed increases.</p>\n<p>The league's proposal includes maximum salaries exceeding $1.1 million, average salaries above $460,000, and minimum salaries over $220,000. A revenue sharing component combined with base salaries would enable these figures. The 2025 league minimum was $66,079 while the supermax reached $249,244.</p>\n<p>Sources told ESPN the union believes the proposal lacks a system where salaries grow sufficiently with the business. This has been a longstanding demand since players opted out of the current CBA in October 2024. Players want a structure similar to the NBA, where the salary cap is determined by basketball-related income.</p>\n<p>The league previously stated it proposed \"significant guaranteed salary cap increases and substantial uncapped revenue sharing that enables player salaries to grow as the league's business grows.\"</p>\n<p>The union responded that the proposal \"put lipstick on a pig and retread a system that isn't tied to any part of the business and intentionally undervalues the players.\"</p>\n<p>Under the current CBA, the salary cap increased annually by a fixed 3% rate. The 2025 salary cap stood at $1,507,100. A separate revenue sharing provision calls for direct payments if the league hits certain revenue targets, but that component has never been triggered during the agreement.</p>\n<p>Both sides agreed to a 30-day extension through November 30 last month. Either party can terminate the agreement with 48 hours' notice. The league and union have continued bargaining with meetings as recent as Wednesday.</p>",
    "link": "https://basketball.realgm.com/wiretap/282862/WNBA-Players-Seek-Revenue-Based-System-View-$11M-Max-Salary-Proposal-As-Insufficient",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-21T11:05:39",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_wnba.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282862/WNBA-Players-Seek-Revenue-Based-System-View-$11M-Max-Salary-Proposal-As-Insufficient"
  },
  {
    "title": "Report: Hornets Not Looking To Trade LaMelo Ball",
    "summary": "<p>A recent report surfaced that the LaMelo Ball and the Charlotte Hornets might be open to a trade of the star guard. In a live stream for Bleacher Report, Jake Fischer reported that he's heard differently.</p>\n<p>\"I can tell you with absolute certainty that the Hornets are not actively looking to move LaMelo Ball any time soon,\" Fischer said about the situation.</p>\n<p>The original report was that Ball had grown frustrated with the Hornets. That has Ball open to a trade from the only team he's played for.</p>\n<p>Fischer said Ball hasn't asked Charlotte for a trade, nor is the team considering it right now.</p>\n<p>\"LaMelo Ball is not asking out, to my understanding,\" Fischer said. \"And the Hornets are not actively looking to trade him by any stretch right now.\"</p>",
    "link": "https://basketball.realgm.com/wiretap/282861/Report-Hornets-Not-Looking-To-Trade-LaMelo-Ball",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-21T09:28:14",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Ball_Lamelo_cha_201215.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282861/Report-Hornets-Not-Looking-To-Trade-LaMelo-Ball"
  },
  {
    "title": "Pelicans Confirm Jordan Dumars As Basketball Operations Consultant",
    "summary": "<p>The New Orleans Pelicans have confirmed that Jordan Dumars, son of Executive Vice President Joe Dumars, serves as a Basketball Operations Consultant. The 34-year-old had been a constant presence at practices, team flights, and high-level meetings for weeks before the organization acknowledged his role. </p>\n<p>According to team sources and rival executives, Jordan Dumars has accompanied the team regularly alongside his father and Senior Vice President Troy Weaver. The three form what sources describe as an insular leadership circle within the organization. The Pelicans acknowledged his omission from official staff listings was an oversight that would be corrected.</p>\n<p>The situation highlights an unusual power structure within the Pelicans organization. Owner Gayle Benson granted Joe Dumars near-total autonomy over basketball decisions after hiring him without a formal search. Weaver handles day-to-day general manager responsibilities while Joe Dumars maintains final authority on major decisions.</p>\n<p>\"I hired Joe Dumars... When he makes a decision, that's up to him. That's why I hired him. I trust Joe... I've left that in his hands,\" Benson told The Times-Picayune.</p>\n<p>Jordan Dumars' background includes time as a walk-on at the University of Michigan and work at Compass Management Group, a financial services firm. The Pelicans confirmed he participates in basketball strategy meetings and conversations.</p>\n<p>Team sources indicate the tight-knit leadership group operates separately from other basketball operations staff. This has created uncertainty among employees about communication channels and decision-making processes.</p>",
    "link": "https://basketball.realgm.com/wiretap/282860/Pelicans-Confirm-Jordan-Dumars-As-Basketball-Operations-Consultant",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-21T07:01:06",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_neworleanspelicans.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282860/Pelicans-Confirm-Jordan-Dumars-As-Basketball-Operations-Consultant"
  },
  {
    "title": "'Growing' Anticipation Jonathan Kuminga Will Get Traded By Warriors",
    "summary": "<p>Anticipation from around the league is \"growing\" that Jonathan Kuminga will get traded by the Golden State Warriors before the trade deadline, sources told Marc Stein of The Stein Line.</p>\n<p>It was reported earlier in the day that Kuminga increasingly feels like <a href=\"https://basketball.realgm.com/wiretap/282845/Jonathan-Kuminga-Feels-Like-Scapegoat-Again;-Jimmy-Butler-Could-Help-Salvage-Situation\">he is being scapegoated</a> for the Warriors' recent struggles. </p>\n<p>Kuminga was demoted from the starting lineup, with the Warriors losing five out of their last seven games.</p>\n<p>\"It's one of the best trade chips in the league,\" an executive told Stein about Kuminga's contract.</p>\n<p>The <a href=\"https://basketball.realgm.com/wiretap/282118/Jonathan-Kuminga-Warriors-Agree-To-Two-Year-$485M-Deal\">Warriors signed Kuminga to a two-year deal</a> last offseason and hold a team option for next summer. He is not eligible to be traded before January 15.</p>",
    "link": "https://basketball.realgm.com/wiretap/282858/Growing-Anticipation-Jonathan-Kuminga-Will-Get-Traded-By-Warriors",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-21T02:39:59",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Kuminga_Jonathan_gsw_241017.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282858/Growing-Anticipation-Jonathan-Kuminga-Will-Get-Traded-By-Warriors"
  },
  {
    "title": "National NBA Games Draw 60M Viewers, Most-Watched Opening Month In 15 Years",
    "summary": "<p>The opening month of nationally televised games on NBC/Peacock, ESPN, and Amazon Prime Video drew over 60 million total viewers, making it the most-watched opening month of the season in 15 years.</p>\n<p>The league attracted over 30 billion views on social media, also setting a record on both their own and third-party platforms.</p>\n<p>Merchandise sales on NBAStore.com are up more than 20%.</p>\n<p>NBA League Pass subscriptions are up more than 10%, with watch times increasing 8%.</p>\n<p>In-arena attendance is at 97% capacity, on pace with last season. </p>",
    "link": "https://basketball.realgm.com/wiretap/282857/National-NBA-Games-Draw-60M-Viewers-Most-Watched-Opening-Month-In-15-Years",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-21T02:37:54",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_realgm.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282857/National-NBA-Games-Draw-60M-Viewers-Most-Watched-Opening-Month-In-15-Years"
  },
  {
    "title": "L.J. Smith Commits To Ohio State For 2027 Class",
    "summary": "<p>L.J. Smith announced his commitment to Ohio State for the class of 2027 on Thursday.</p>\n<p>Smith is the first five-star prospect to make a commitment this early into the recruitment cycle.</p>\n<p>\"I picked Ohio State because it felt like home to me,\" Smith said. \"I feel like it's a place where I can succeed and reach my goals.\"</p>\n<p>Smith is currently ranked No. 10 in the SC Next 60 for the 2027 class.</p>\n<p>Smith is also Ohio State's highest-ranked recruit since Jared Sullinger in 2010. </p>",
    "link": "https://basketball.realgm.com/wiretap/282856/LJ-Smith-Commits-To-Ohio-State-For-2027-Class",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-21T02:32:34",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Logo_OhioState.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282856/LJ-Smith-Commits-To-Ohio-State-For-2027-Class"
  },
  {
    "title": "Tyrese Maxey Called 'Heart And Soul' Of Sixers, Compared To Allen Iverson By Paul George",
    "summary": "<p>Philadelphia 76ers guard Tyrese Maxey is averaging 32.5 points and 7.8 assists per game through 14 games, prompting praise from teammate Paul George. George told The Athletic that Maxey has improved from last season and compared his impact to Allen Iverson's influence on the franchise. Maxey ranks second in the NBA in scoring and is building a case for his first All-NBA selection.</p>\n<p>George said he realized the extent of Maxey's improvement during Monday's game against the Los Angeles Clippers. The forward watched Maxey's performance from the bench and turned to point guard Kyle Lowry to acknowledge the guard's development.</p>\n<p>\"I looked at Kyle, and I said, 'Yo, Tyrese really got better,'\" George told The Athletic.</p>\n<p>Maxey leads the league in minutes played at just over 40 per game. His durability has been critical for a 76ers team dealing with significant injury issues. George has played only one game this season, while Joel Embiid has been on a minutes restriction and missed the last four games with knee soreness.</p>\n<p>\"He's the heart and soul of this team,\" George said. \"This is similar to what Allen Iverson once did for the city. He's our battery, and we're witnessing one of them ones.\"</p>\n<p>Maxey is shooting 42 percent from 3-point range and averaging nearly five rebounds per game. The 76ers are 8-6 despite limited availability from key players. Nick Nurse acknowledged the team's reliance on Maxey during this stretch.</p>\n<p>\"It's evident how much we need him,\" Nurse said. \"The minutes are going to be there. They are going to be at around 40. He's got to carry the load.\"</p>\n<p>Toronto Raptors coach Darko Rajakovic praised Maxey's physical development and conditioning after Wednesday's game. The Raptors trapped Maxey in pick-and-rolls and shaded help defense toward him throughout the contest.</p>\n<p>\"His body has gotten better. He's stronger and more well-conditioned,\" Rajakovic said. \"I admire how hard he has played every single night.\"</p>",
    "link": "https://basketball.realgm.com/wiretap/282855/Tyrese-Maxey-Called-Heart-And-Soul-Of-Sixers-Compared-To-Allen-Iverson-By-Paul-George",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-20T23:15:32",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Maxey_Tyrese_phi_231219.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282855/Tyrese-Maxey-Called-Heart-And-Soul-Of-Sixers-Compared-To-Allen-Iverson-By-Paul-George"
  },
  {
    "title": "Mavericks Won't Rush GM Search To Replace Nico Harrison",
    "summary": "<p>The Dallas Mavericks will not rush their search for a new general manager following Nico Harrison's departure, sources told The Athletic. Governor Patrick Dumont was in China this week on Sands Corporation business while the team operates with co-interim general managers Matt Riccardi and Michael Finley. One source with knowledge of ownership's thinking said qualifications will determine the hire, not timeline.</p>\n<p>It is possible the current power structure remains through the February 5 trade deadline. Mark Cuban, who holds a 27 percent stake in the team, has returned as an advisor to Dumont. Cuban told The Athletic that Dumont \"makes all the final decisions\" while he serves in an advisory capacity.</p>\n<p>Dennis Lindsey is a candidate Cuban has endorsed. Lindsey served as an advisor to the Mavericks in 2023-24 and currently works as second-in-command with the Detroit Pistons. He had a successful nine-year run as the Utah Jazz's lead executive before joining Detroit.</p>\n<p>\"Good demeanor. Knows the game. Experienced. Has sat in the seat before,\" one former league executive who has worked with Lindsey said.</p>\n<p>NBA reporter Marc Stein reported that Mavericks ownership seeks a \"willing communicator who can comfortably update the public on the team's plans and outlook.\" The emphasis on communication comes after public messaging missteps following the Luka Doncic trade. Coach Jason Kidd remains an influential voice with Dumont throughout the search process.</p>\n<p>Team sources expressed hope the next hire can bring stability to a franchise dealing with self-inflicted chaos over the past 10 months. The Mavericks appointed Riccardi and Finley as co-interim general managers last week after parting ways with Harrison.</p>",
    "link": "https://basketball.realgm.com/wiretap/282854/Mavericks-Wont-Rush-GM-Search-To-Replace-Nico-Harrison",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-20T22:21:11",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_dallasmavericks.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282854/Mavericks-Wont-Rush-GM-Search-To-Replace-Nico-Harrison"
  },
  {
    "title": "Mavericks Intend To Keep Kyrie Irving",
    "summary": "<p>The Dallas Mavericks hope to keep Kyrie Irving, sources tell Marc Stein. Irving remains out indefinitely after undergoing surgery to repair a torn ACL, but he is \"vibing nicely\" with Cooper Flagg in practice settings.</p>\n<p>The Mavericks re-signed Irving in the offseason on <a href=\"https://basketball.realgm.com/wiretap/280935/Kyrie-Irving-Mavericks-Agree-To-Three-Year-$119M-Deal\">a three-year, $119 million deal</a>. Irving agreed to lower his salary for the 25-26 season from his player option in order to allow the Mavericks to utilize the $5.7 million taxpayer midlevel exception that they used on D'Angelo Russell. </p>\n<p>Dallas is \"not encouraging trade inquiries\" for Irving, which is in contrast to their position on Anthony Davis as they are expected to listen to offers for the big man leading to the trade deadline. </p>\n<p>The Mavericks have a much stronger need at guard as opposed to their excess of power forwards and centers in Davis, Flagg, PJ Washington, Daniel Gafford and Dereck Lively. Gafford is a trade candidate as he has a favorable health outlook and is on a manageable $54.4 million deal over the next three seasons.</p>\n<p>Irving is also a fan favorite with the Mavericks as a key element of their run to the Finals in 2024.</p>",
    "link": "https://basketball.realgm.com/wiretap/282853/Mavericks-Intend-To-Keep-Kyrie-Irving",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-20T22:11:25",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Irving_Kyrie_dal_250206.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282853/Mavericks-Intend-To-Keep-Kyrie-Irving"
  },
  {
    "title": "Report: LaMelo Ball, Hornets Open To Trade Possibility",
    "summary": "<p>LaMelo Ball is open to a trade from the Charlotte Hornets, sources tell Kelly Iko of Yahoo Sports. Ball has become increasingly frustrated with the franchise. For their part, sources tell Yahoo that the Hornets are open to moving Ball. Ball has $130 million remaining over the next three seasons on his contract, but is only 24 years old and could play to his talents following a change of scenery. </p>\n<p>The Hornets have a 4-11 record and Ball was benched for the final 4:32 of their 127-119 loss to the 2-13 Indiana Pacers on Wednesday. </p>\n<p>Ball is averaging 21.6 points, 6.9 reboudns, 9.6 assists in 31.4 minutes over nine games this season with the Hornets. Ball is shooting less than 30 percent on three-pointers this season and under 40 percent from the floor.</p>\n<p>Ball was the third overall pick in the 2020 NBA draft and won Rookie of the Year. After he was an All-Star in 2022, Ball has dealt with injuries and inconsistent play.</p>\n<p>Head coach Charles Lee wants the Hornets to play in a more structured offensive system that also provides opportunities and spacing for Brandon Miller, Miles Bridges and Kon Knueppel. </p>\n<p>Ball responded to the Yahoo report on X with a clown emoji. </p>",
    "link": "https://basketball.realgm.com/wiretap/282852/Report-LaMelo-Ball-Hornets-Open-To-Trade-Possibility",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-20T21:59:09",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Ball_Lamelo_cha_201215.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282852/Report-LaMelo-Ball-Hornets-Open-To-Trade-Possibility"
  },
  {
    "title": "Hollinger & Duncan: 6 in 24; Time to Panic?!?!?!?",
    "summary": "<p></p>\n<div class=\"episode-long-desc\">\n<p>Nate and John continue their look at the Eastern Conference with discussion of Indiana, Brooklyn, Boston, Charlotte, Washington, and Orlando.</p>\n<p>Then, we look at five teams at the bottom of the West and assign them a panic rating based on how badly their seasons have started.</p>\n</div>\n<div class=\"episode-long-desc\">\n<p>Dunc'd On Prime is the only place to get every episode with Nate & Danny, plus every pod with John Hollinger & Nate as well! <a href=\"http://duncdon.supportingcast.fm/join\">DuncdOn.SupportingCast.FM </a></p>\n<p><a href=\"https://www.youtube.com/c/NateDuncan\">Subscribe on YouTube</a> to see our hilarious faces and, more importantly, see the key moments from the pod each week.</p>\n<p>Or, sign up for our FREE mailing list to get <a href=\"https://supportingcast.us17.list-manage.com/subscribe?u=dccd41580f4391a31c00ca695&amp;id=52b46b92ee\">Dan Feldman's Daily Duncs</a> with all the major topics around the league twice a week.</p>\n</div>\n<p></p>",
    "link": "https://basketball.realgm.com/wiretap/282851/Hollinger-Duncan-6-in-24;-Time-to-Panic!!!",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-20T20:28:13",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Morant_Ja_mem_241028.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282851/Hollinger-Duncan-6-in-24;-Time-to-Panic!!!"
  },
  {
    "title": "Domantas Sabonis Out At Least 3-4 Weeks With Partially Torn Meniscus",
    "summary": "<p>Domantas Sabonis has suffered a partially torn meniscus in his left knee and will be re-evaluated in three to four weeks. The Sacramento Kings have a 3-12 record to start the season and there has been an expectation they could pivot to a rebuild by the trade deadline.</p>\n<p>Sabonis, who is signed through 2028, is averaging 17.2 points, 12.3 rebounds and 3.7 assists in 33.2 minutes over 11 games this season.</p>\n<p>Sabonis was most recently an All-Star in 2023 when the Kings also made the playoffs. </p>\n<p><a href=\"https://basketball.realgm.com/wiretap/282770/Teams-Showing-Interest-In-Domantas-Sabonis\">Last week, it was reported that teams were showing interest in trading for Sabonis</a>.</p>",
    "link": "https://basketball.realgm.com/wiretap/282850/Domantas-Sabonis-Out-At-Least-3-4-Weeks-With-Partially-Torn-Meniscus",
    "author": "RealGM Basketball Wiretap",
    "source": "RealGM Basketball Wiretap",
    "published": "2025-11-20T17:43:00",
    "image": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Sabonis_Domantas_sac_220211.jpg",
    "tags": [],
    "id": "https://basketball.realgm.com/wiretap/282850/Domantas-Sabonis-Out-At-Least-3-4-Weeks-With-Partially-Torn-Meniscus"
  }
]